{
  "backend/main.mo": "Main actor for the RevReel/RevGrid backend, defining all data types (UserProfile, PostRecord, Comment, Message, Event, BuildShowcase, MarketplaceListing) and state maps, with query/update functions for profiles, posts, follows, likes, comments, messages, events, builds, and marketplace listings, using authorization and blob-storage mixins.",
  "backend/migration.mo": "Migration module that upgrades stored user profiles from the old schema (without `profilePicData`) to the new schema (with `profilePicData: ?Text` defaulting to null) for both `principalProfiles` and `users` maps.",
  "feature_evidence.json": "Feature evidence report documenting the profile picture upload feature (EditProfileModal base64 encoding, `updateProfilePic` backend call, and avatar display across multiple components) with associated file list, component dependencies, and test ID REQ-47.",
  "frontend-file-summaries.txt": "Text file containing short summaries of each frontend source file, describing the purpose and key behaviors of components, pages, and hooks in the RevReel app.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes, including colors for background, foreground, primary, secondary, muted, accent, destructive, border, chart, and sidebar variables.",
  "frontend/index.html": "HTML entry point for the RevReel frontend, setting the page title to \"RevReel\" and mounting the React app via the `/src/main.tsx` module script.",
  "frontend/src/App.tsx": "Main TanStack Router configuration that defines all app routes (home, reels, reels-search, discover, events, profile, messages, mechanics, builds, create) wrapped in AuthGate and Layout components.",
  "frontend/src/components/AuthGate.tsx": "Authentication gate that shows a loading splash while initializing, the LandingPage for unauthenticated users, a profile setup form for new users without a profile, and renders children for fully authenticated users with existing profiles.",
  "frontend/src/components/BottomNav.tsx": "Renders a fixed bottom navigation bar with links to Home, Reels, Events, and Profile, plus a center Create button that opens the CreatePostSheet.",
  "frontend/src/components/CommentsSheet.tsx": "A bottom sheet component that displays comments for a given post and allows the current user to submit new comments.",
  "frontend/src/components/CreatePostSheet.tsx": "A bottom sheet that presents four content-creation options (Feed Post, Reel, Build Showcase, Mechanic Question) and navigates to the corresponding creation route on selection.",
  "frontend/src/components/EditProfileModal.tsx": "A dialog modal for editing the current user's profile, supporting display name, bio, car info, and profile picture upload with preview.",
  "frontend/src/components/LandingPage.tsx": "Full-screen landing page with a background image, RevGrid branding, and an Internet Identity login button.",
  "frontend/src/components/Layout.tsx": "Root layout component that composes TopBar, an affiliate parts banner, the routed page content via Outlet, and BottomNav.",
  "frontend/src/components/PostCard.tsx": "Displays a single post with author info, image, like/comment actions, and a delete option for the post's author, including a confirmation dialog.",
  "frontend/src/components/TopBar.tsx": "Fixed top header that shows a dynamic page title based on the current route, along with navigation buttons for messages and notifications.",
  "frontend/src/components/UserListItem.tsx": "Renders a clickable user list item with avatar, display name, username, and optional car info. Navigates to the user's profile page on click unless a custom onClick handler is provided.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage. Invalidates and refetches all dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login, logout, identity state, and login status. Includes a useInternetIdentity hook for consuming the context in child components.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for all backend data fetching and mutations, including posts, comments, likes, user profiles, and builds. Each hook wires up the actor from useActor and manages cache invalidation on mutations.",
  "frontend/src/index.css": "Defines global styles using Tailwind CSS with a dark automotive theme, custom OKLCH CSS variables for colors, and utility classes for effects like amber glow, glass card, and racing stripes. Imports Rajdhani and Inter fonts.",
  "frontend/src/lib/utils.ts": "Provides utility functions including cn for merging Tailwind class names and several timestamp formatting helpers (relative time, date, and datetime) that convert nanosecond bigint timestamps.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider. Mounts the App component into the DOM root.",
  "frontend/src/pages/BuildDetailPage.tsx": "Displays a detailed view of a single car build including an image gallery with navigation, build metadata, and a comments section with the ability to add new comments. Handles loading and not-found states.",
  "frontend/src/pages/BuildsPage.tsx": "Displays a grid of all car build showcases with thumbnail images, titles, and author names. Includes a button to create a new build and handles empty and loading states.",
  "frontend/src/pages/ChatThreadPage.tsx": "Displays a direct message thread between the current user and a recipient, enforcing a follow-relationship gate before allowing messaging, with options to send messages or follow the other user.",
  "frontend/src/pages/CreateBuildPage.tsx": "Form page for creating a new car build showcase with title, description, and specs fields, submitting via the useCreateBuild mutation and navigating to the new build on success.",
  "frontend/src/pages/CreateEventPage.tsx": "Form page for creating a car meet event with title, location, date/time, and description fields, converting the date to nanoseconds before submitting via the useCreateEvent mutation.",
  "frontend/src/pages/CreateFeedPostPage.tsx": "Form page for creating a feed-type post with a caption and comma-separated tags, submitting via the useCreatePost mutation with PostType.feed.",
  "frontend/src/pages/CreateMechanicQuestionPage.tsx": "Form page for posting a mechanic question with a detailed description and tags, submitting via the useCreatePost mutation with PostType.mechanic.",
  "frontend/src/pages/CreateReelPage.tsx": "Form page for creating a short-form car reel post with a caption and tags, submitting via the useCreatePost mutation with PostType.reel.",
  "frontend/src/pages/DiscoverPage.tsx": "Discover page with a search bar for users and a tabbed grid view for browsing posts, builds, reels, mechanics, and events. Includes a shortcut to a dedicated reels search page.",
  "frontend/src/pages/EventDetailPage.tsx": "Detail page for a single event showing image, date, location, attendee count, and description, with a button to mark attendance.",
  "frontend/src/pages/EventsPage.tsx": "Lists all car meet events with a hero image, a create-event button, and a scrollable list of event cards showing date, location, and attendee count.",
  "frontend/src/pages/FollowersPage.tsx": "Displays a list of followers for a given user profile, fetching each follower's data and rendering it with UserListItem.",
  "frontend/src/pages/FollowingPage.tsx": "Displays a list of users that a given profile is following, fetching each followee's data and rendering it with UserListItem.",
  "frontend/src/pages/HomePage.tsx": "Main feed page that fetches and renders all posts as PostCard components, with skeleton loading states and an empty-state prompt.",
  "frontend/src/pages/MechanicsPage.tsx": "Displays a list of mechanic-help questions fetched from the feed, with a hero image, an 'Ask a Question' button, and a scrollable list of question cards showing image, caption, author, and tags.",
  "frontend/src/pages/MechanicThreadPage.tsx": "Q&A thread page for a mechanic post, displaying the original question with tags and a list of answers (comments), plus an input to submit new answers.",
  "frontend/src/pages/MessagesPage.tsx": "Shows a list of direct-message conversations limited to mutual followers/following connections, rendering each connected user as a tappable item that navigates to the conversation view.",
  "frontend/src/pages/ProfilePage.tsx": "Renders a user profile page with avatar, bio, follower/following counts, follow/unfollow actions, and tabbed sections for feed posts, reels, and builds, supporting both own-profile and other-user views.",
  "frontend/src/pages/ReelsPage.tsx": "Implements a TikTok-style vertical-scroll reels feed where each reel auto-plays video when active, supports mute toggle, like/unlike, comments sheet, and delete for the post author.",
  "frontend/src/pages/ReelsSearchPage.tsx": "Provides a debounced search interface for reels with category filter chips, displaying results as thumbnail cards with author info, or skeleton placeholders while loading.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear those parameters via sessionStorage and history.replaceState.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom fonts (Rajdhani, Inter), and an extended color palette using OKLCH values including custom amber, asphalt, chart, and sidebar color scales, plus typography, container-queries, and animate plugins.",
  "project_state.json": "Project state snapshot describing a car-culture social media app (RevReel) with its architectural notes, existing features, known issues, and versioned feature list covering feed, reels, marketplace, events, messaging, and more."
}