{
  "backend/main.mo": "Main Motoko actor defining all backend state and API for a car-enthusiast social platform, including user profiles, posts, comments, messages, events, builds, marketplace listings, follows, and likes, with authorization via access control mixins.",
  "feature_evidence.json": "Feature evidence report mapping implemented features (Marketplace page, Create Listing page, and route registration) to their source files, components, test IDs, and confidence levels.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of each frontend source file, describing the purpose and key functionality of every component, page, and hook in the project.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes, including colors for background, foreground, card, primary, destructive, chart, and sidebar variables.",
  "frontend/index.html": "Minimal HTML shell for the React app with the browser tab title set to 'RevReel' and a root div mounting the main.tsx module.",
  "frontend/src/App.tsx": "Main TanStack Router configuration registering all application routes under an AuthGate/Layout shell, including routes for home, reels, discover, events, profile, messages, mechanics, builds, and the two new marketplace routes.",
  "frontend/src/components/AuthGate.tsx": "Authentication gate that shows a landing page for unauthenticated users, a profile setup form for new users without a profile, and renders children for fully authenticated users with existing profiles.",
  "frontend/src/components/BottomNav.tsx": "Renders a fixed bottom navigation bar with links to main app routes and a Create button that opens the CreatePostSheet.",
  "frontend/src/components/CommentsSheet.tsx": "A bottom sheet component that displays comments for a given post and allows the current user to submit new comments.",
  "frontend/src/components/CreatePostSheet.tsx": "A bottom sheet presenting content creation options (feed post, reel, build, mechanic question, marketplace listing) that navigate to the corresponding create routes.",
  "frontend/src/components/EditProfileModal.tsx": "A dialog modal for editing the user's profile, including display name, bio, car info, and profile picture upload with base64 encoding.",
  "frontend/src/components/LandingPage.tsx": "Full-screen landing page with a background image and Internet Identity login button for unauthenticated users.",
  "frontend/src/components/Layout.tsx": "Main app layout wrapping routed pages with a TopBar, an affiliate aftermarket parts banner, a content outlet, and a BottomNav.",
  "frontend/src/components/PostCard.tsx": "Displays a single post with author info, image, like/unlike toggle, comment count, and a delete option for the post's author.",
  "frontend/src/components/TopBar.tsx": "Fixed top header that shows a dynamic page title based on the current route along with navigation buttons for messages and notifications.",
  "frontend/src/components/UserListItem.tsx": "Renders a clickable user list item with avatar, display name, username, and optional car info. Navigates to the user's profile page on click unless a custom onClick handler is provided.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage. Invalidates and refetches all dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login, logout, identity state, and login status. Persists identity across page reloads and exposes a React context hook for consuming components.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for all backend data fetching and mutations, including posts, comments, likes, users, and builds. Each hook wires up the actor from useActor and handles cache invalidation on mutations.",
  "frontend/src/index.css": "Defines global styles using Tailwind CSS with a dark automotive theme, custom OKLCH CSS variables for colors, and utility classes for effects like amber glow, glass card, and racing stripes. Imports Rajdhani and Inter fonts.",
  "frontend/src/lib/utils.ts": "Provides utility functions including a Tailwind class merger (cn), and timestamp formatting helpers (formatDistanceToNow, formatDate, formatDateTime) that convert nanosecond bigint timestamps to human-readable strings.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped with QueryClientProvider and InternetIdentityProvider into the DOM root.",
  "frontend/src/pages/BuildDetailPage.tsx": "Displays a detailed view of a single car build including an image gallery with navigation, build metadata, and a comments section with the ability to add new comments. Handles loading and not-found states.",
  "frontend/src/pages/BuildsPage.tsx": "Lists all car build showcases in a two-column image grid with navigation to individual build detail pages. Includes a header with a create button and handles empty and loading states.",
  "frontend/src/pages/ChatThreadPage.tsx": "Displays a chat conversation thread between the current user and a receiver, enforcing a follow-relationship gate before allowing messaging, with options to send messages or follow the other user.",
  "frontend/src/pages/CreateBuildPage.tsx": "Form page for creating a new car build showcase with title, description, and specs fields, submitting via the useCreateBuild hook and navigating to the new build on success.",
  "frontend/src/pages/CreateEventPage.tsx": "Form page for creating a car meet event with title, location, date/time, and description fields, converting the date to nanoseconds before submitting via the useCreateEvent hook.",
  "frontend/src/pages/CreateFeedPostPage.tsx": "Form page for creating a social feed post with an optional image upload (max 1.5 MB), caption, and tags, encoding image data into the caption JSON before submitting via useCreatePost.",
  "frontend/src/pages/CreateListingPage.tsx": "Form page for creating a marketplace listing with title, price, category, condition, description, and an optional image upload (max 1.5 MB), submitting via the useCreateListing hook.",
  "frontend/src/pages/CreateMechanicQuestionPage.tsx": "Form page for posting a mechanic help question with a description and comma-separated tags, submitting as a mechanic-type post via useCreatePost and navigating to the mechanics feed on success.",
  "frontend/src/pages/CreateReelPage.tsx": "Form page for creating a new reel post, supporting video/image upload (max 1.5 MB), caption, tags, and category selection, with media encoded as base64 in the post caption.",
  "frontend/src/pages/DiscoverPage.tsx": "Discovery page with a search bar for users and a tabbed grid view for browsing posts, builds, reels, mechanics, and events, with shortcuts to reels search and marketplace.",
  "frontend/src/pages/EventDetailPage.tsx": "Detail view for a single event showing image, date, location, attendee count, and description, with a button to mark attendance.",
  "frontend/src/pages/EventsPage.tsx": "Lists all car meet events with image, date, location, and attendee count, and provides a button to navigate to the event creation page.",
  "frontend/src/pages/FollowersPage.tsx": "Displays a list of followers for a given user profile by fetching follower IDs and rendering each as a UserListItem.",
  "frontend/src/pages/FollowingPage.tsx": "Displays a list of users that a given profile is following, rendering each as a UserListItem component.",
  "frontend/src/pages/HomePage.tsx": "Main feed page that fetches and renders all posts as PostCard components, with loading skeletons and an empty state prompt.",
  "frontend/src/pages/MarketplacePage.tsx": "Displays a marketplace listing page with category filtering, a grid of ListingCard components showing item details (image, price, condition, seller), and a button to create new listings.",
  "frontend/src/pages/MechanicsPage.tsx": "Lists all mechanic help questions fetched from the feed, with a hero image, an 'Ask a Question' button, and clickable question cards navigating to individual threads.",
  "frontend/src/pages/MechanicThreadPage.tsx": "Shows a single mechanic Q&A thread with the original question post, its comments/answers, and an input form to submit new answers.",
  "frontend/src/pages/MessagesPage.tsx": "Displays a list of chat-eligible connections (mutual followers) as conversation items, or an empty state prompting the user to follow others to unlock messaging.",
  "frontend/src/pages/ProfilePage.tsx": "Renders a user profile page with avatar, follow/unfollow actions, follower/following counts, and tabbed sections for feed posts, reels, and builds, with edit and delete capabilities for the owner.",
  "frontend/src/pages/ReelsPage.tsx": "Full-screen vertical-swipe reels viewer that plays video/image posts, supports like/unlike, comments, delete, and mute toggle. Parses captions that may contain embedded base64 media data alongside plain text.",
  "frontend/src/pages/ReelsSearchPage.tsx": "Search and browse reels by keyword or predefined car-culture categories, displaying results in a responsive grid of reel cards with debounced query input and skeleton loading states.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routes, persisting them to sessionStorage, and cleaning sensitive params from the URL bar without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration enabling dark mode, custom OKLCH-based color palettes (amber, asphalt, chart, sidebar), custom heading/body fonts, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state manifest (version 33) describing the car-enthusiast social media app's features, architecture, and a list of known bugs to fix including missing branding, broken upload flows, and missing navigation entries."
}