{
  "backend/main.mo": "Main Motoko actor for the RevGrid/RevReel app, defining all data types (UserProfile, PostRecord, Comment, Message, Event, BuildShowcase, MarketplaceListing) and state maps, plus public query/update functions for profiles, posts, comments, messages, events, builds, marketplace listings, follows, and likes with access control enforcement.",
  "backend/migration.mo": "Migration module that upgrades the actor state by transforming OldPostRecord (without mediaData) to NewPostRecord (with mediaData set to null), passing all other state maps through unchanged.",
  "feature_evidence.json": "Feature evidence report documenting a single implemented feature: increasing the reel/video upload file size limit on CreateReelPage from ~1.5–2 MB to at least 10 MB, with updated validation and error messaging.",
  "frontend-file-summaries.txt": "Auto-generated JSON summary file describing the purpose and key changes of each frontend source file in the project, used for build planning and documentation.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes, including colors for background, foreground, card, primary, secondary, muted, accent, destructive, border, chart, and sidebar variables.",
  "frontend/index.html": "HTML shell entry point for the frontend app, setting the browser tab title to 'RevReel' and mounting the React app via the root div and main.tsx module script.",
  "frontend/src/App.tsx": "Main React app router configuration using TanStack Router, registering all application routes including pages for home, reels, discover, events, profile, messages, mechanics, builds, marketplace, and auth gating via AuthGate and Layout.",
  "frontend/src/components/AuthGate.tsx": "Authentication gate component that shows a loading splash during initialization, the LandingPage for unauthenticated users, a profile setup form for new users without a profile, and renders children for fully authenticated users.",
  "frontend/src/components/BottomNav.tsx": "Renders a fixed bottom navigation bar with links to main app routes and a Create button that opens the CreatePostSheet.",
  "frontend/src/components/CommentsSheet.tsx": "A bottom sheet component that displays comments for a given post and allows the current user to submit new comments.",
  "frontend/src/components/CreatePostSheet.tsx": "A bottom sheet that presents content creation options (feed post, reel, build, mechanic question, marketplace listing) and navigates to the selected creation route.",
  "frontend/src/components/EditProfileModal.tsx": "A dialog modal for editing the user's profile, supporting display name, bio, car info, and profile picture upload with preview.",
  "frontend/src/components/LandingPage.tsx": "Full-screen landing page with a background image and Internet Identity login button for unauthenticated users.",
  "frontend/src/components/Layout.tsx": "Main app layout wrapping all authenticated pages with a TopBar, an affiliate parts banner, a content outlet, and a BottomNav.",
  "frontend/src/components/PostCard.tsx": "Displays a single feed post with author info, image, like/comment actions, and a delete option for the post's author.",
  "frontend/src/components/TopBar.tsx": "Fixed top header that shows a dynamic page title based on the current route along with navigation buttons for messages and notifications.",
  "frontend/src/components/UserListItem.tsx": "Renders a clickable user list item with avatar, display name, username, and optional car info. Navigates to the user's profile page on click unless a custom onClick handler is provided.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated identities. Invalidates and refetches all dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider using DFINITY's AuthClient, exposing login, logout, identity state, and login status. Persists identity across page reloads and exposes a useInternetIdentity hook for consuming components.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for fetching and mutating backend data, including user profiles, posts, comments, likes, and builds. Each hook wraps actor calls with proper enabled guards and cache invalidation on mutations.",
  "frontend/src/index.css": "Defines global styles using Tailwind CSS with a dark automotive theme featuring amber/orange accents and custom CSS variables. Includes utility classes for racing stripes, amber glow effects, glass cards, and scrollbar hiding.",
  "frontend/src/lib/utils.ts": "Provides utility functions including a Tailwind class merger (cn), and timestamp formatting helpers (formatDistanceToNow, formatDate, formatDateTime) that convert nanosecond bigint timestamps to human-readable strings.",
  "frontend/src/main.tsx": "Application entry point that renders the React app with QueryClientProvider and InternetIdentityProvider wrappers around the root App component.",
  "frontend/src/pages/BuildDetailPage.tsx": "Displays a detailed view of a single car build including an image gallery with navigation, build metadata, and a comments section with the ability to add new comments.",
  "frontend/src/pages/BuildsPage.tsx": "Displays a grid of all car build showcases with thumbnail images, titles, and author names. Includes a button to create a new build and an empty state when no builds exist.",
  "frontend/src/pages/ChatThreadPage.tsx": "Displays a chat conversation thread between the current user and a receiver, enforcing a follow-relationship gate before allowing messaging, with options to send messages or follow the other user.",
  "frontend/src/pages/CreateBuildPage.tsx": "Form page for creating a new car build showcase with title, description, and specs fields, submitting via the useCreateBuild hook and navigating to the new build on success.",
  "frontend/src/pages/CreateEventPage.tsx": "Form page for creating a car meet event with title, location, date/time, and description fields, converting the date to nanoseconds before submitting via the useCreateEvent hook.",
  "frontend/src/pages/CreateFeedPostPage.tsx": "Form page for creating a social feed post with an optional image upload (max 1.5 MB), caption, and tags, encoding image data into the caption JSON before submitting via useCreatePost.",
  "frontend/src/pages/CreateListingPage.tsx": "Form page for creating a marketplace listing with title, price, category, condition, description, and an optional image upload (max 1.5 MB), submitting via the useCreateListing hook.",
  "frontend/src/pages/CreateMechanicQuestionPage.tsx": "Form page for posting a mechanic help question with a description and comma-separated tags, submitting as a mechanic-type post via the useCreatePost hook.",
  "frontend/src/pages/CreateReelPage.tsx": "Form page for creating a new reel post, supporting video/image file upload (max 10MB), caption, tags, and category selection, with encoded media data submitted via the createPost mutation.",
  "frontend/src/pages/DiscoverPage.tsx": "Discovery page with a search bar for users and a tabbed grid view for browsing posts, builds, reels, mechanics, and events, with shortcuts to Reels Search and Marketplace.",
  "frontend/src/pages/EventDetailPage.tsx": "Detail view for a single event showing its image, date, location, attendee count, and description, with a button to mark attendance.",
  "frontend/src/pages/EventsPage.tsx": "Lists all car meet events with a hero image, a create-event button, and a scrollable list of event cards showing date, location, and attendee count.",
  "frontend/src/pages/FollowersPage.tsx": "Displays a list of followers for a given user profile by fetching follower IDs and rendering each as a UserListItem.",
  "frontend/src/pages/FollowingPage.tsx": "Displays a list of users that a given profile is following by fetching following IDs and rendering each as a UserListItem.",
  "frontend/src/pages/HomePage.tsx": "Main feed page that fetches and renders all posts as PostCard components, with loading skeletons, an empty state, and a manual refresh button.",
  "frontend/src/pages/MarketplacePage.tsx": "Displays a marketplace listing page with category filtering, a grid of ListingCard components showing item details (image, price, condition, seller), and a button to create new listings.",
  "frontend/src/pages/MechanicsPage.tsx": "Lists all mechanic help questions fetched from the feed, with a hero image, an 'Ask a Question' button, and navigation to individual question threads.",
  "frontend/src/pages/MechanicThreadPage.tsx": "Shows a single mechanic Q&A thread with the original question post, its comments/answers, and an input form to submit new answers.",
  "frontend/src/pages/MessagesPage.tsx": "Displays a list of users the current user is connected to (followers/following) as conversation entries, navigating to a specific conversation on click.",
  "frontend/src/pages/ProfilePage.tsx": "Renders a user profile page with avatar, stats, follow/unfollow actions, and tabbed views of the user's feed posts, reels, and builds, with support for editing own profile and deleting posts.",
  "frontend/src/pages/ReelsPage.tsx": "Full-screen vertical-scrolling reels viewer that plays video/image posts one at a time, with like, comment, delete, mute/unmute, and author navigation controls. Parses captions that may contain embedded base64 media data alongside plain text.",
  "frontend/src/pages/ReelsSearchPage.tsx": "Search and browse reels page with debounced text search, category filter chips, and a responsive grid of reel cards showing thumbnails, author avatars, and captions.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routes, persisting them to sessionStorage, and cleaning sensitive params from the URL bar without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Rajdhani, Inter), OKLCH-based color palettes (amber, asphalt, chart, sidebar), CSS-variable-driven semantic colors, and plugins for typography, container queries, and animations.",
  "project_state.json": "Snapshot of the project's current state (version 35) describing the car-culture social media app's architecture, existing features, and known issues such as missing branding, broken upload flows, and inaccessible pages."
}