{
  "backend/main.mo": "Main Motoko actor for the RevGrid backend, defining data types and state maps for users, posts, comments, messages, events, builds, marketplace listings, follows, and likes, along with query/update methods for profile management, social interactions, and content CRUD operations with access control.",
  "feature_evidence.json": "Feature evidence report tracking two eBay affiliate banner features: saving a Honda Civic photo as a static asset and replacing the text-based banner in Layout.tsx with an image-based banner displayed alongside BullBoost and Enjuku Racing banners in a horizontal row.",
  "frontend-file-summaries.txt": "JSON document containing short summaries of each frontend source file, describing the purpose and key behaviors of components, pages, and hooks in the RevGrid React frontend.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining CSS custom property design tokens for light and dark themes, covering background, foreground, primary, secondary, muted, accent, destructive, border, chart, and sidebar color variables.",
  "frontend/index.html": "HTML entry point for the RevGrid frontend with comprehensive SEO metadata including Google site verification, Open Graph tags, Twitter Card tags, and a descriptive title targeting car enthusiast keywords.",
  "frontend/public/sitemap.xml": "XML sitemap listing the main public URLs of revgrid.app with their change frequencies and priority values for search engine indexing.",
  "frontend/src/App.tsx": "Main React application file that defines the TanStack Router configuration with all page routes nested under an AuthGate/Layout root, wrapped in an ErrorBoundary and ThemeProvider, including routes for feed, reels, discover, events, profile, messages, builds, marketplace, and StreetTube.",
  "frontend/src/components/AuthGate.tsx": "Wraps the app with authentication logic using Internet Identity, showing a landing page to unauthenticated users and a profile setup form to newly authenticated users without a profile. Includes timeout handling for both auth initialization and profile loading.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with links to Home, Reels, Discover, Events, and Profile, plus a Create button that opens the CreatePostSheet.",
  "frontend/src/components/CommentsSheet.tsx": "Bottom sheet component that displays a post's comments with author avatars and allows authenticated users to submit new comments.",
  "frontend/src/components/CreatePostSheet.tsx": "Bottom sheet presenting content creation options (Feed Post, Reel, Build Showcase, Mechanic Question, Marketplace listing) that navigate to their respective creation routes.",
  "frontend/src/components/EditProfileModal.tsx": "Dialog modal for editing a user's profile, supporting display name, bio, car info, and profile picture upload with file size validation.",
  "frontend/src/components/LandingPage.tsx": "Animated landing page with an image slideshow intro, background music with mute toggle, and an Internet Identity login button; auto-forwards already-authenticated users into the app.",
  "frontend/src/components/Layout.tsx": "Main app layout wrapping routed pages with a TopBar, a sponsor banner row (eBay, BullBoost, Enjuku Racing), a scrollable main content area, and a BottomNav.",
  "frontend/src/components/PostCard.tsx": "Renders a social media post card with author info, image, like/comment actions, and a delete confirmation dialog. Uses React Query hooks for like counts, user profile, and like/unlike mutations.",
  "frontend/src/components/TopBar.tsx": "Fixed top navigation bar that displays the current page title and icon buttons for messages, notifications, StreetTube, tuner shop, and about page.",
  "frontend/src/components/UserListItem.tsx": "Renders a clickable user list row with avatar, display name, username, and optional car info, navigating to the user's profile on click.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login, logout, and status tracking via DFINITY's AuthClient, exposed through a React context and hook.",
  "frontend/src/hooks/useLandingMusic.ts": "Manages background audio playback for the landing page, supporting fade-in/fade-out, mute toggle, and graceful fallback for autoplay-blocked browsers.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend data fetching and mutations, including user profiles, posts, infinite feed pagination, likes, comments, follows, and marketplace listings.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts (Rajdhani, Inter), sets up Tailwind directives, defines a dark automotive-themed color palette using OKLCH variables, and adds custom utility classes like racing-stripe, amber-glow, and glass-card.",
  "frontend/src/lib/utils.ts": "Utility module exporting a Tailwind class merger (cn), and timestamp formatting helpers (formatDistanceToNow, formatDate, formatDateTime) that convert nanosecond bigint timestamps to human-readable strings.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with QueryClientProvider (React Query) and InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AboutPage.tsx": "About page for the RevGrid app displaying a hero section with logo, feature list, app description, and a donation/support section with a copyable CashApp handle.",
  "frontend/src/pages/BuildDetailPage.tsx": "Detail page for a single car build showing an image gallery with navigation, build metadata, and a comment section where logged-in users can post comments.",
  "frontend/src/pages/BuildsPage.tsx": "Grid listing page for all car build showcases with a header, loading state, empty state, and navigation to individual build detail or creation pages.",
  "frontend/src/pages/ChatThreadPage.tsx": "Direct message thread page that displays a conversation between two users, enforces a mutual-follow requirement to send messages, and provides a follow prompt if no relationship exists.",
  "frontend/src/pages/CreateBuildPage.tsx": "Form page for creating a new car build showcase with fields for title, description, specs, and an image upload (max 10 MB) that encodes the image as base64 in the specs payload before submitting.",
  "frontend/src/pages/CreateEventPage.tsx": "Form page for creating a new car meet event with title, location, date/time, and description fields; submits via useCreateEvent mutation and navigates to the new event on success.",
  "frontend/src/pages/CreateFeedPostPage.tsx": "Form page for creating a feed post with caption, tags, and optional image upload (max 10 MB); encodes media as base64 in the caption JSON and submits via useCreatePost mutation.",
  "frontend/src/pages/CreateListingPage.tsx": "Form page for creating a marketplace listing with title, description, price, condition, category, and optional image upload; submits via useCreateListing mutation and navigates to the marketplace on success.",
  "frontend/src/pages/CreateMechanicQuestionPage.tsx": "Form page for posting a mechanic question with a description, tags, and optional image attachment; submits as a PostType.mechanic post via useCreatePost and navigates to the mechanics section.",
  "frontend/src/pages/CreateReelPage.tsx": "Form page for creating a reel post with caption, tags, category, and an optional video or image file (max 10 MB); encodes media as base64 JSON in the caption and submits via useCreatePost as PostType.reel.",
  "frontend/src/pages/DiscoverPage.tsx": "Discover page with a search bar for users and a tabbed grid view of posts, builds, reels, mechanics, and events, plus shortcuts to Reels Search and Marketplace.",
  "frontend/src/pages/EventDetailPage.tsx": "Detail view for a single event showing image, date, location, attendee count, and description, with an attend button that updates attendance state.",
  "frontend/src/pages/EventsPage.tsx": "Lists all car meet events with a hero image, a create-event button, and a scrollable list of event cards showing date, location, and attendee count.",
  "frontend/src/pages/FollowersPage.tsx": "Displays a list of followers for a given user profile by fetching follower IDs and rendering each as a UserListItem.",
  "frontend/src/pages/FollowingPage.tsx": "Displays a list of users that a given profile is following, fetching followee IDs and rendering each as a UserListItem.",
  "frontend/src/pages/HomePage.tsx": "Infinite-scroll feed page that loads paginated posts using an IntersectionObserver sentinel, showing skeletons while loading and an end-of-feed indicator when exhausted.",
  "frontend/src/pages/MarketplacePage.tsx": "Marketplace page showing a filterable grid of listings by category, with each card displaying image, price, condition badge, and seller info.",
  "frontend/src/pages/MechanicsPage.tsx": "Lists all mechanic help questions fetched from the feed and provides a button to navigate to the question creation page.",
  "frontend/src/pages/MechanicThreadPage.tsx": "Displays a single mechanic Q&A thread with the original question, its comments/answers, and a form to submit new answers using React Query hooks.",
  "frontend/src/pages/MessagesPage.tsx": "Shows a list of users the current user is connected to (followers/following) and allows navigating to individual direct message conversations.",
  "frontend/src/pages/ProfilePage.tsx": "Renders a user profile page with avatar, stats, follow/unfollow actions, and tabbed views of the user's feed posts, reels, and builds.",
  "frontend/src/pages/ReelsPage.tsx": "Implements a vertical full-screen reels feed with video/image playback, like, comment, and delete functionality using a snap-scroll layout.",
  "frontend/src/pages/ReelsSearchPage.tsx": "A search page for reels that debounces user input, fetches matching reel posts, and displays them in a grid of vertical thumbnail cards with category badges and author info. Also shows predefined category filter chips and loading skeletons.",
  "frontend/src/pages/StreetTubePage.tsx": "A self-contained YouTube-like video sharing page ('StreetTube') that uses localStorage for all data persistence, supporting user auth, video upload/playback, comments, subscriptions, likes, watch history, notifications, and light/dark theming.",
  "frontend/src/pages/TunerShopPage.tsx": "A static marketing/info page for 'Altered Imports', a Honda and Acura performance shop, displaying a hero image, about section, list of services with icons, and contact/location details.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routes, persisting them to sessionStorage, and cleaning sensitive params from the URL hash without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration that sets up dark mode, custom font families (Rajdhani, Inter), an extended color palette using OKLCH (including amber, asphalt, chart, and sidebar tokens), and registers the typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the full state of the RevGrid car enthusiast social media app project, including architecture notes, known issues, existing features, and image requirements. Serves as the source of truth for project version, feature inventory, and outstanding bugs."
}