{
  "backend/main.mo": "Main Motoko actor for the RevGrid backend, defining data types and stable stores for users, posts, comments, messages, events, builds, marketplace listings, follows, and likes, along with CRUD and query endpoints with access-control enforcement.",
  "backend/migration.mo": "Motoko migration module that defines the old and new actor state shapes (identical in this version) and exports a no-op `run` function to pass state through on upgrade.",
  "feature_evidence.json": "Feature evidence report mapping two frontend bug-fix features (React Query cache configuration and post-creation data-loss fixes) to their relevant source files, components, and test IDs.",
  "frontend-file-summaries.txt": "A JSON document containing short natural-language summaries of each frontend source file, used as build-planning reference for the project's React frontend.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.) used throughout the app.",
  "frontend/index.html": "HTML shell for the React SPA with full SEO metadata including Google site verification, Open Graph, and Twitter Card tags for the RevGrid car enthusiast platform.",
  "frontend/public/sitemap.xml": "XML sitemap listing the main public URLs of revgrid.app (feed, reels, discover, events, marketplace, about, tuner-shop, reels-search) with change frequencies and priorities.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all application routes (feed, reels, profile, messages, builds, marketplace, leaderboard, etc.) wrapped in an ErrorBoundary, ThemeProvider, and AuthGate.",
  "frontend/src/components/AuthGate.tsx": "Handles authentication flow by showing a loading state, landing/intro page, or profile setup form depending on auth and profile status. Wraps authenticated children and manages user creation via Internet Identity.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with links to Home, Reels, Discover, Leaderboard, and Profile, plus a center Create button that opens a CreatePostSheet.",
  "frontend/src/components/CommentsSheet.tsx": "Bottom sheet component that displays a post's comments with author avatars and allows authenticated users to submit new comments.",
  "frontend/src/components/CreatePostSheet.tsx": "Bottom sheet presenting content creation options (Feed Post, Reel, Build Showcase, Mechanic Question, Marketplace listing) that navigate to their respective creation routes.",
  "frontend/src/components/EditProfileModal.tsx": "Dialog modal for editing a user's display name, bio, car info, and profile picture, with file size validation and save/upload logic.",
  "frontend/src/components/LandingPage.tsx": "Landing page with an auto-advancing intro slideshow and background music, transitioning to a login screen where users authenticate via Internet Identity.",
  "frontend/src/components/Layout.tsx": "Main app layout wrapping page content with a TopBar, sponsor banner row (eBay, BullBoost, Enjuku Racing), a router Outlet, and a BottomNav.",
  "frontend/src/components/PostCard.tsx": "Renders a social media post card with author info, image, like/comment actions, and a delete confirmation dialog. Uses React Query hooks for like counts and user profile data.",
  "frontend/src/components/TopBar.tsx": "Fixed top navigation bar that displays a dynamic page title based on the current route and provides icon buttons for messages, notifications, StreetTube, tuner shop, and about page.",
  "frontend/src/components/UserListItem.tsx": "Renders a clickable user list row with avatar, display name, username, and optional car info, navigating to the user's profile on click.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries whenever the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login, logout, and status tracking via DFINITY's AuthClient, exposed through a React context provider and hook.",
  "frontend/src/hooks/useLandingMusic.ts": "Custom hook that manages background audio playback for the landing page, supporting fade-in/fade-out, mute toggling, and graceful handling of browser autoplay restrictions.",
  "frontend/src/hooks/useQueries.ts": "Central collection of React Query hooks wrapping all backend actor calls for users, posts, likes, comments, events, builds, marketplace listings, and leaderboard data with cache invalidation and error toasts.",
  "frontend/src/index.css": "Global CSS file that imports Google Fonts, sets up Tailwind directives, defines dark/light theme CSS variables using oklch colors, and adds custom styles for AI answer content, scrollbars, and utility classes.",
  "frontend/src/lib/utils.ts": "Utility module exporting a Tailwind class merger (`cn`) and timestamp formatting helpers (`formatDistanceToNow`, `formatDate`, `formatDateTime`) that convert nanosecond bigint timestamps to human-readable strings.",
  "frontend/src/main.tsx": "React app entry point that wraps the App component with TanStack Query's QueryClientProvider and a custom InternetIdentityProvider before mounting to the DOM.",
  "frontend/src/pages/AboutPage.tsx": "Static About page for RevGrid that displays the app's branding, feature list, and a donation/support section with a copyable CashApp handle and social links.",
  "frontend/src/pages/BuildDetailPage.tsx": "Detail page for a single car build that shows an image gallery with navigation, build metadata, and a comment section where authenticated users can post comments.",
  "frontend/src/pages/BuildsPage.tsx": "Grid-layout page listing all car builds fetched from the backend, with navigation to individual build details and a button to create a new build.",
  "frontend/src/pages/ChatThreadPage.tsx": "Direct message thread page that loads a conversation by ID, enforces a mutual-follow requirement before allowing messaging, and provides a send-message input with auto-scroll to the latest message.",
  "frontend/src/pages/CreateBuildPage.tsx": "Form page for creating a car build showcase with title, description, specs, and optional image upload (max 10 MB), embedding image data in specs as JSON before submitting via the useCreateBuild mutation.",
  "frontend/src/pages/CreateEventPage.tsx": "Form page for creating a car meet event with title, location, date/time, and description fields, converting the date to nanoseconds before submitting via the useCreateEvent mutation.",
  "frontend/src/pages/CreateFeedPostPage.tsx": "Form page for creating a feed post with a caption, optional image upload, and tags, embedding the image as base64 JSON in the caption payload before submitting via the useCreatePost mutation.",
  "frontend/src/pages/CreateListingPage.tsx": "Form page for creating a marketplace listing with title, description, price, condition, category, and optional image upload, submitting via the useCreateListing mutation with base64-encoded image data.",
  "frontend/src/pages/CreateMechanicQuestionPage.tsx": "Form page for posting a mechanic question with an optional image, serializing the question and image as JSON in the caption and submitting as a mechanic-type post via useCreatePost, with an AI-answer notice displayed to the user.",
  "frontend/src/pages/CreateReelPage.tsx": "Form page for creating a new reel post, allowing users to upload a video or image (max 10MB), add a caption, tags, and category, then submit via the createPost mutation.",
  "frontend/src/pages/DiscoverPage.tsx": "Discovery page with a search bar for users and a tabbed grid view for browsing posts, builds, reels, mechanics, and events, with shortcuts to the reels search and marketplace pages.",
  "frontend/src/pages/EventDetailPage.tsx": "Detail page for a single event, showing its hero image, metadata (date, location, attendees), and an attend button, with loading, error, and not-found states.",
  "frontend/src/pages/EventsPage.tsx": "Lists all car events with skeleton loading and error states, and includes a dialog form for creating new events with title, description, location, and date fields.",
  "frontend/src/pages/FollowersPage.tsx": "Displays a list of followers for a given user profile by fetching follower IDs and rendering each as a UserListItem component.",
  "frontend/src/pages/FollowingPage.tsx": "Displays a list of users that a given profile is following, fetching following IDs and rendering each as a UserListItem component.",
  "frontend/src/pages/HomePage.tsx": "Infinite-scroll feed page that loads paginated posts using an IntersectionObserver sentinel, with skeleton loading, error, and empty states.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays a racing-themed leaderboard with a top-3 podium and ranked list of users sorted by follower count, fetched via useGetLeaderboard hook.",
  "frontend/src/pages/MarketplacePage.tsx": "Shows a filterable grid of car parts/accessories marketplace listings with category tabs, seller info, and a button to create new listings.",
  "frontend/src/pages/MechanicsPage.tsx": "Lists community mechanic help questions filtered by PostType.mechanic, with an AI-powered answers banner and a button to post new questions.",
  "frontend/src/pages/MechanicThreadPage.tsx": "Renders a single mechanic Q&A thread with an AI-generated answer card (via useAskMechanicAI) and a community comment section.",
  "frontend/src/pages/MessagesPage.tsx": "Displays a list of direct-message conversations limited to mutual followers/following connections, navigating to individual conversation threads.",
  "frontend/src/pages/ProfilePage.tsx": "Displays a user profile page with avatar, follower/following counts, and tabbed post/reel/build grids. Supports follow/unfollow, post deletion, and editing the current user's own profile via a modal.",
  "frontend/src/pages/ReelsPage.tsx": "Full-screen vertical scroll reel viewer that plays video or shows image posts with like, comment, delete, and mute controls. Uses snap scrolling to track the active reel and auto-plays/pauses video accordingly.",
  "frontend/src/pages/ReelsSearchPage.tsx": "Search page for reels featuring debounced query input, category filter chips, and a grid of ReelCard thumbnails. Shows skeletons while loading and falls back to a category-browsing UI when no query is entered.",
  "frontend/src/pages/StreetTubePage.tsx": "Self-contained YouTube-like video platform (StreetTube) stored entirely in localStorage, supporting user auth, video upload, comments, subscriptions, likes, watch history, and notifications. Includes multiple view modes and a light/dark theme toggle.",
  "frontend/src/pages/TunerShopPage.tsx": "Static marketing page for 'Altered Imports,' a Honda/Acura performance shop, displaying a hero image, about section, and a list of services with icons. Also includes contact info and social media links.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL parameters from both query strings and hash-based routing, with helpers to persist, retrieve, and clear those parameters via sessionStorage and history.replaceState.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration for the RevGrid frontend, defining dark mode, custom color palettes (amber, asphalt, chart, sidebar) using OKLCH values, custom fonts (Rajdhani, Inter), and enabling the typography, container-queries, and animate plugins.",
  "project_state.json": "Project state tracking file for RevGrid that records known issues (posts being erased on refresh), existing fix features around React Query cache configuration and post creation flow, and a pending architectural request to ensure backend Motoko actor uses stable variables for post persistence."
}