{
  "backend/main.mo": "Main Motoko actor for the RevGrid backend, defining data types and state maps for users, posts, comments, messages, events, builds, marketplace listings, follows, and likes, with access-controlled query and update methods for all CRUD operations.",
  "feature_evidence.json": "Feature evidence report mapping two implemented features — fixing the blank white screen on load and implementing guest view mode — to their relevant source files, components, and test IDs.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing one-to-two sentence summaries of each frontend source file, serving as a reference document for the project's frontend components, pages, and hooks.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for the design system's color tokens in both light and dark themes, plus base border and background/text body styles.",
  "frontend/index.html": "HTML entry point for RevGrid with full SEO metadata, Open Graph/Twitter card tags, PWA manifest link, and an inline service worker registration script.",
  "frontend/public/manifest.json": "PWA web app manifest for RevGrid specifying app name, theme colors, standalone display mode, and two icon sizes (192x192 and 512x512).",
  "frontend/public/sitemap.xml": "XML sitemap listing nine RevGrid public URLs with their change frequencies and priority values for search engine indexing.",
  "frontend/public/sw.js": "Service worker implementing a cache-first strategy for app shell assets and network-first for ICP/API calls, with offline fallback to index.html for navigation requests.",
  "frontend/src/App.tsx": "Main application entry point that defines all routes using TanStack Router with lazy-loaded pages, wraps the app in QueryClient, ThemeProvider, and AuthGate, and sets up error boundaries.",
  "frontend/src/components/AuthGate.tsx": "Wraps the app to handle authentication state: shows a loading spinner during initialization, a profile setup form for authenticated users without a profile, and renders children for all other cases including guests.",
  "frontend/src/components/AuthRequiredWrapper.tsx": "HOC that redirects unauthenticated users to a specified route and shows a loading spinner while authentication state is being determined.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with links to Home, Reels, Discover, Leaderboard, and Profile, plus a center Create button that opens a CreatePostSheet for authenticated users or prompts sign-in for guests.",
  "frontend/src/components/ClickableUsername.tsx": "Renders a clickable username button that navigates to the user's profile page when clicked, with optional @ prefix display.",
  "frontend/src/components/CommentsSheet.tsx": "Bottom sheet component that displays a post's comments list and provides an input form for authenticated users to add new comments, with guest sign-in prompt for unauthenticated users.",
  "frontend/src/components/CreatePostSheet.tsx": "Bottom sheet presenting content creation options (Feed Post, Reel, Build Showcase, Mechanic Question, Listing) as a grid of buttons that navigate to the respective creation pages.",
  "frontend/src/components/EditProfileModal.tsx": "Dialog modal for editing user profile fields (display name, bio, car info) and uploading a new profile picture, with file size validation and save/error handling via mutation hooks.",
  "frontend/src/components/ErrorBoundary.tsx": "React class component that catches runtime errors and displays a branded error screen with a reload button, showing error details in dev mode.",
  "frontend/src/components/GuestPromptBanner.tsx": "A dismissible top banner prompting unauthenticated users to sign in via Internet Identity, with a login button that invalidates React Query cache on success.",
  "frontend/src/components/LandingPage.tsx": "Full-screen landing page with an auto-advancing image slideshow and Internet Identity login button, redirecting to the app on successful authentication.",
  "frontend/src/components/Layout.tsx": "Main app shell that composes TopBar, BottomNav, a sponsor banner, the GuestPromptBanner for unauthenticated users, and a Suspense-wrapped Outlet for route content.",
  "frontend/src/components/LoadingFallback.tsx": "Simple full-screen loading spinner component displaying the RevGrid logo with a pulsing animation and bouncing dots.",
  "frontend/src/components/PostCard.tsx": "Card component for displaying a social post with media, like/comment actions, owner delete capability, and a guest auth check that gates interactions.",
  "frontend/src/components/ProfileSetupForm.tsx": "Form for new users to create their RevGrid profile by submitting a username, display name, bio, and car info to the backend actor.",
  "frontend/src/components/TopBar.tsx": "Fixed top navigation bar that displays a dynamic page title and icon buttons for messages, notifications, StreetTube, tuner shop, app install, and about pages.",
  "frontend/src/components/UserListItem.tsx": "Renders a clickable user list row with avatar, display name, username, and optional car info, navigating to the user's profile on click.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous backend actor using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useGuestCheck.ts": "Hook that exposes authentication state and a `requireAuth` helper that shows a toast with a sign-in prompt when an unauthenticated user attempts a protected action.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, managing AuthClient creation, login, logout, and identity persistence across page reloads.",
  "frontend/src/hooks/useLandingMusic.ts": "Hook that manages background audio playback for the landing page, supporting fade-in/fade-out, mute toggling, and graceful handling of browser autoplay restrictions.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend data fetching and mutations, covering user profiles, posts, comments, events, marketplace listings, messages, and more.",
  "frontend/src/index.css": "Global stylesheet that defines Tailwind CSS layers, CSS custom properties for dark/light themes, typography utilities, AI answer content styles, and scrollbar styling.",
  "frontend/src/lib/utils.ts": "Utility module exporting a `cn` class-merging helper and timestamp formatting functions (`formatDistanceToNow`, `formatDate`, `formatDateTime`) that convert nanosecond bigints.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity providers wrapping the root `App` component.",
  "frontend/src/pages/AboutPage.tsx": "Displays the RevGrid app's about/marketing page with a hero section, feature list, and a donation/support section with a copyable CashApp handle.",
  "frontend/src/pages/BuildDetailPage.tsx": "Shows a single car build's detail view with an image gallery, build info, author details, and a comment section with guest-auth gating.",
  "frontend/src/pages/BuildsPage.tsx": "Lists all car build showcases in a two-column grid with loading skeletons, and provides a create button that requires authentication.",
  "frontend/src/pages/ChatThreadPage.tsx": "Renders a direct-message thread between the current user and another user, enforcing a mutual-follow connection requirement before allowing messaging.",
  "frontend/src/pages/CreateBuildPage.tsx": "Auth-gated form page for creating a new car build showcase with optional image upload, title, description, and specs fields.",
  "frontend/src/pages/CreateEventPage.tsx": "Auth-gated form page for creating a new car event with title, description, location, and datetime fields.",
  "frontend/src/pages/CreateFeedPostPage.tsx": "Page for creating a feed post with optional image upload, caption, and comma-separated tags, wrapped in an auth guard.",
  "frontend/src/pages/CreateListingPage.tsx": "Page for creating a marketplace listing with fields for title, description, price, condition, category, and an optional image upload.",
  "frontend/src/pages/CreateMechanicQuestionPage.tsx": "Page for submitting a mechanic question post with an optional image, question text, and tags, navigating to /mechanics on success.",
  "frontend/src/pages/CreateReelPage.tsx": "Page for creating a reel post with optional media upload, a category selector, caption, and tags, navigating to /reels on success.",
  "frontend/src/pages/DiscoverPage.tsx": "Discover page with a user search input and tabbed grid view for browsing posts, builds, reels, mechanic posts, and events, with shortcuts to reels search and marketplace.",
  "frontend/src/pages/EventDetailPage.tsx": "Detail page for a single event showing its image, date, location, attendee count, description, and an attend button gated behind authentication.",
  "frontend/src/pages/EventsPage.tsx": "Displays a list of all events sorted by date with options to create new events, showing loading skeletons and error states. Requires authentication to create events via guest check.",
  "frontend/src/pages/FollowersPage.tsx": "Shows a paginated list of followers for a given user profile, fetching each follower's data individually and rendering them as UserListItem components.",
  "frontend/src/pages/FollowingPage.tsx": "Shows a paginated list of users that a given profile is following, fetching each followee's data individually and rendering them as UserListItem components.",
  "frontend/src/pages/HomePage.tsx": "Renders an infinite-scroll feed of posts using IntersectionObserver to trigger pagination, with loading skeletons and error/empty states.",
  "frontend/src/pages/InstallPage.tsx": "Guides users through installing RevGrid as a PWA, supporting the native browser install prompt on Android and displaying manual step-by-step instructions as a fallback.",
  "frontend/src/pages/LeaderboardPage.tsx": "Displays a ranked leaderboard of users with a podium view for the top 3 and a race-row list for the rest, sorted by follower count.",
  "frontend/src/pages/MarketplacePage.tsx": "Shows a filterable grid of marketplace listings by category, with options to create new listings and displaying item images, prices, and seller usernames.",
  "frontend/src/pages/MechanicsPage.tsx": "Lists all mechanic Q&A posts sorted by recency, with an AI-powered answers banner and a button to navigate to the question creation page.",
  "frontend/src/pages/MechanicThreadPage.tsx": "Displays a single mechanic Q&A thread with the original question, an AI-generated answer card, and a community comments section with a comment submission form.",
  "frontend/src/pages/MessagesPage.tsx": "Shows a list of users the current user follows or is followed by, allowing navigation to individual message threads; requires authentication.",
  "frontend/src/pages/ProfilePage.tsx": "Renders a user profile with cover photo, avatar, follower/following counts, follow/unfollow actions, and tabbed views of the user's feed, reel, and build posts with delete support.",
  "frontend/src/pages/ReelsPage.tsx": "Full-screen vertical snap-scrolling reels feed that auto-plays videos when active, with like, comment, delete, and mute controls per reel.",
  "frontend/src/pages/ReelsSearchPage.tsx": "Search page for reels featuring debounced query input, category filter chips, and a grid of reel cards with thumbnails and author info.",
  "frontend/src/pages/StreetTubePage.tsx": "A self-contained YouTube-like video sharing page ('StreetTube') with full CRUD for users, videos, comments, subscriptions, likes, watch history, and notifications, all persisted via localStorage. Includes dark/light theming, search, trending, and a custom video player.",
  "frontend/src/pages/TunerShopPage.tsx": "A static informational page for 'Altered Imports', a Honda/Acura performance shop, displaying a hero image, about section, services list, and contact/social links.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routes, persisting them to sessionStorage, and cleaning sensitive params from the URL bar without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color palettes (amber, asphalt, chart, sidebar), custom heading/body fonts (Rajdhani, Inter), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata for 'RevGrid' tracking schema version, existing features (blank-screen fix, guest view mode), a pending guest-view feature request, and a known production loading issue."
}