{
  "backend/main.mo": "Main Motoko actor for the RevGrid app, defining data types (UserProfile, Post, Event, Build, MarketplaceListing, etc.) and CRUD/query methods for users, posts, comments, messages, events, builds, marketplace listings, follows, and likes, with access control and blob storage mixins.",
  "backend/migration.mo": "Migration module that upgrades the actor state from OldActor (without marketplace listings) to NewActor by adding an empty marketplaceListings map while preserving all other state.",
  "feature_evidence.json": "Empty feature evidence report JSON file with no features listed.",
  "frontend-file-summaries.txt": "JSON document summarizing key frontend component files, describing LandingPage, AuthGate, Layout, and index.html at a high level.",
  "frontend/index.css": "Global CSS file that sets up Tailwind base/components/utilities and defines CSS custom properties for light and dark theme color tokens (background, foreground, primary, chart colors, sidebar, etc.).",
  "frontend/index.html": "Minimal HTML entry point that sets the page title to 'RevReel' and mounts the React app via the root div and main.tsx module script.",
  "frontend/src/App.tsx": "Defines the TanStack Router route tree for the entire app, mapping all page components (Home, Reels, Discover, Events, Profile, Messages, Mechanics, Builds, Create) under an AuthGate-wrapped Layout root route.",
  "frontend/src/components/AuthGate.tsx": "Authentication gate that shows a loading splash while initializing, the LandingPage for unauthenticated users, a profile setup form for new users without a profile, and renders children for fully authenticated users.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with Home, Reels, Create (opens CreatePostSheet), Events, and Profile tabs, highlighting the active route and rendering a prominent circular Create button.",
  "frontend/src/components/CommentsSheet.tsx": "A bottom sheet component that displays and allows posting comments for a given post, fetching comments via query hooks and supporting keyboard/button submission.",
  "frontend/src/components/CreatePostSheet.tsx": "A bottom sheet presenting four content creation options (Feed Post, Reel, Build Showcase, Mechanic Question) that navigate to their respective creation routes on selection.",
  "frontend/src/components/EditProfileModal.tsx": "A dialog modal for editing the current user's display name, car info, and bio, pre-populated from their profile and saved via a mutation hook.",
  "frontend/src/components/LandingPage.tsx": "A full-screen landing page with a background image, RevGrid branding, and an Internet Identity login button that shows a loading state during authentication.",
  "frontend/src/components/Layout.tsx": "The main app shell that composes TopBar, an affiliate parts banner, a routed main content area via Outlet, and BottomNav.",
  "frontend/src/components/PostCard.tsx": "A feed post card displaying author info, post content, and action buttons for liking, commenting, following, and sharing, with optimistic like state.",
  "frontend/src/components/TopBar.tsx": "A fixed top navigation bar that shows a dynamic page title based on the current route along with message and notification icon buttons.",
  "frontend/src/components/UserListItem.tsx": "A list item component displaying a user's avatar, name, and car info with a follow/unfollow button that navigates to the user's profile on click.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor using React Query, supporting both anonymous and authenticated (Internet Identity) usage, and invalidates dependent queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing login/logout state via DFINITY's AuthClient and exposing identity, status flags, and login/clear functions to child components.",
  "frontend/src/hooks/useQueries.ts": "Centralizes all React Query hooks for backend data fetching and mutations, covering user profiles, posts, comments, messages, events, and build showcases via the ICP actor.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures a dark automotive-themed design system with OKLCH CSS variables, and defines utility classes for effects like amber glow, glass cards, and racing stripes.",
  "frontend/src/lib/utils.ts": "Utility module exporting a Tailwind class merger (`cn`) and timestamp formatting helpers that convert nanosecond bigint timestamps to human-readable relative or absolute date strings.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with React Query and Internet Identity providers wrapping the root App component.",
  "frontend/src/pages/BuildDetailPage.tsx": "Page component displaying a single build showcase with an image gallery, build details, and a comment section supporting adding new comments for authenticated users.",
  "frontend/src/pages/BuildsPage.tsx": "Page component listing all build showcases in a two-column image grid with navigation to individual build details and a button to create a new build.",
  "frontend/src/pages/ChatThreadPage.tsx": "Displays a direct message conversation thread between the current user and a recipient, with message rendering, auto-scroll to bottom, and a send message input.",
  "frontend/src/pages/CreateBuildPage.tsx": "Form page for creating a new car build showcase with title, description, and specs fields, navigating to the build detail page on success.",
  "frontend/src/pages/CreateEventPage.tsx": "Form page for creating a car meet event with title, location, date/time, and description fields, converting the date to nanoseconds before submission.",
  "frontend/src/pages/CreateFeedPostPage.tsx": "Form page for creating a feed-type post with a caption and comma-separated tags, submitting via the useCreatePost hook.",
  "frontend/src/pages/CreateMechanicQuestionPage.tsx": "Form page for posting a mechanic question with a detailed description and tags, submitting as a mechanic-type post.",
  "frontend/src/pages/CreateReelPage.tsx": "Form page for creating a short-form reel post with a caption and tags, submitting as a reel-type post and navigating to the reels page on success.",
  "frontend/src/pages/DiscoverPage.tsx": "A discovery page with a search bar for finding users and a tabbed grid view for browsing all posts, builds, reels, mechanic posts, and events. Clicking a grid item navigates to the corresponding detail page.",
  "frontend/src/pages/EventDetailPage.tsx": "Displays full details for a single event (image, date, location, attendee count, description) and allows the current user to mark themselves as attending.",
  "frontend/src/pages/EventsPage.tsx": "Lists all car meet events with a hero image, a create-event button, and a scrollable list showing each event's thumbnail, date, location, and attendee count.",
  "frontend/src/pages/FollowersPage.tsx": "Shows a list of followers for a given user profile by fetching follower IDs and rendering each as a UserListItem component.",
  "frontend/src/pages/FollowingPage.tsx": "Shows a list of users that a given profile is following, fetching followee IDs and rendering each as a UserListItem component.",
  "frontend/src/pages/HomePage.tsx": "The main feed page that fetches and renders all posts as PostCard components with skeleton loading states and an empty-state prompt to create the first post.",
  "frontend/src/pages/MechanicsPage.tsx": "Displays a mechanics Q&A feed page with a hero image, an 'Ask a Question' button, and a list of mechanic-type posts fetched via useGetFeed. Each question shows an image or icon, caption, author, timestamp, and tags.",
  "frontend/src/pages/MechanicThreadPage.tsx": "A Q&A thread page for a mechanic post that displays the original question with tags and image, lists all comments as answers, and provides an input to submit a new answer.",
  "frontend/src/pages/MessagesPage.tsx": "Renders a messaging page listing all unique community members (derived from posts) as conversation entry points. Clicking a user navigates to their direct message conversation thread.",
  "frontend/src/pages/ProfilePage.tsx": "Shows a user profile page with avatar, follow/unfollow controls, and tabbed views for posts, reels, and builds. Supports both own-profile and other-user views with an edit profile modal for the current user.",
  "frontend/src/pages/ReelsPage.tsx": "Implements a vertical snap-scrolling reels feed where each reel displays a full-screen image with like, comment, share, and follow actions. Uses active-item tracking to highlight the currently visible reel.",
  "frontend/src/utils/urlParams.ts": "Provides utility functions for reading URL query parameters from both standard and hash-based routing, persisting them to sessionStorage, and cleaning sensitive params from the URL hash without reloading.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining custom color palettes (amber, asphalt, chart, sidebar), custom fonts (Rajdhani, Inter), CSS variable-based semantic colors, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the overall project state (version 11) for RevReel, a car-enthusiast social media app, including architectural notes, existing features, known issues, and image requirements."
}