{
  "backend/main.mo": "Main Motoko actor for the RevGrid backend, defining data types and state maps for users, posts, comments, messages, events, builds, and marketplace listings, along with query/update functions for profile management, posts, follows, likes, comments, messaging, events, builds, and marketplace operations.",
  "feature_evidence.json": "Feature evidence report confirming that the BullBoost Performance logo banner update (new image asset + clickable anchor in Layout.tsx) has been implemented, with high confidence tied to test REQ-153.",
  "frontend-file-summaries.txt": "A JSON document containing one-sentence summaries of each frontend source file, describing the purpose and key behaviors of components, pages, and hooks in the RevGrid app.",
  "frontend/index.css": "Global CSS entry point that imports Tailwind base/components/utilities and defines light and dark mode CSS custom properties for the design system's color tokens.",
  "frontend/index.html": "HTML entry point for the RevGrid SPA with full SEO metadata including Google site verification, Open Graph, and Twitter Card tags, loading the React app via /src/main.tsx.",
  "frontend/public/sitemap.xml": "XML sitemap listing the main public URLs of revgrid.app with their change frequencies and priority values for search engine crawling.",
  "frontend/src/App.tsx": "Main React app entry point that defines all TanStack Router routes (including /streettube), wraps the app in an ErrorBoundary and ThemeProvider, and renders the AuthGate around the Layout component.",
  "frontend/src/components/AuthGate.tsx": "Authentication gate component that always plays the flash intro on page load, handles Internet Identity login, enforces auth/profile-loading timeouts, and shows a profile setup form for new users before rendering the authenticated app.",
  "frontend/src/components/BottomNav.tsx": "Renders a fixed bottom navigation bar with links to main app routes (Home, Reels, Discover, Events, Profile) and a Create button that opens the CreatePostSheet.",
  "frontend/src/components/CommentsSheet.tsx": "A bottom sheet component that displays comments for a given post and allows the current user to submit new comments.",
  "frontend/src/components/CreatePostSheet.tsx": "A bottom sheet that presents creation options (Feed Post, Reel, Build Showcase, Mechanic Question, Marketplace listing) and navigates to the corresponding route on selection.",
  "frontend/src/components/EditProfileModal.tsx": "A dialog modal for editing the user's profile, supporting display name, bio, car info, and profile picture upload with file size validation.",
  "frontend/src/components/LandingPage.tsx": "An animated landing page with an image slideshow intro, background music controls, and Internet Identity login flow that auto-forwards authenticated users into the app.",
  "frontend/src/components/Layout.tsx": "The main app shell that composes TopBar, a sponsor banner row with affiliate links, the routed page content via Outlet, and BottomNav.",
  "frontend/src/components/PostCard.tsx": "Displays a single feed post with author info, image, like/unlike toggle, comment count, and a delete option for the post's author.",
  "frontend/src/components/TopBar.tsx": "Fixed top navigation bar that displays the current page title and provides icon buttons for messages, notifications, StreetTube, tuner shop, and about page navigation.",
  "frontend/src/components/UserListItem.tsx": "Reusable button component that renders a user's avatar, display name, username, and car info, navigating to their profile on click.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useLandingMusic.ts": "Custom hook that manages background audio playback for the landing page, supporting fade-in/fade-out, mute toggling, and graceful autoplay fallback.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for fetching and mutating user profiles, posts, feed, events, messages, and other app data.",
  "frontend/src/index.css": "Global stylesheet defining a dark automotive-themed design system with Tailwind CSS, custom OKLCH color tokens, Rajdhani/Inter fonts, and utility classes like amber glow and glass card effects.",
  "frontend/src/lib/utils.ts": "Utility functions for merging Tailwind class names and formatting bigint nanosecond timestamps into human-readable relative or absolute date strings.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrapping the root App component.",
  "frontend/src/pages/AboutPage.tsx": "Displays the RevGrid app's about/info page with a hero section, feature list, and a CashApp donation button with copy-to-clipboard functionality.",
  "frontend/src/pages/BuildDetailPage.tsx": "Shows a single car build's detail view with an image gallery, build metadata, and a comment section allowing logged-in users to post comments.",
  "frontend/src/pages/BuildsPage.tsx": "Lists all car builds in a 2-column grid with thumbnails and navigates to individual build detail pages; includes a button to create a new build.",
  "frontend/src/pages/ChatThreadPage.tsx": "Renders a direct message thread between two users, enforcing a mutual-follow requirement before messaging and providing a send-message input.",
  "frontend/src/pages/CreateBuildPage.tsx": "Form page for creating a new car build showcase with title, description, specs, and an image upload (max 10 MB) that embeds media data into the specs payload.",
  "frontend/src/pages/CreateEventPage.tsx": "Form page for creating a new car meet event with fields for title, location, date/time, and description, converting the date to nanoseconds before submission.",
  "frontend/src/pages/CreateFeedPostPage.tsx": "A form page for creating a new feed post with a caption, optional image upload (max 10 MB), and tags, which encodes media as base64 in the caption JSON before submitting via the useCreatePost hook.",
  "frontend/src/pages/CreateListingPage.tsx": "A form page for creating a marketplace listing with title, description, price, condition, category, and an optional image upload (max 10 MB), submitting via the useCreateListing hook.",
  "frontend/src/pages/CreateMechanicQuestionPage.tsx": "A form page for posting a mechanic question with a description, optional image upload (max 10 MB), and tags, submitting as a PostType.mechanic post via the useCreatePost hook.",
  "frontend/src/pages/CreateReelPage.tsx": "A form page for creating a reel post with a caption, category, tags, and an optional video or image upload (max 10 MB), encoding media as base64 JSON before submitting as a PostType.reel post.",
  "frontend/src/pages/DiscoverPage.tsx": "A discovery page with a search bar for finding users and a tabbed grid view for browsing posts, builds, reels, mechanic questions, and events, with shortcuts to the reels search and marketplace pages.",
  "frontend/src/pages/EventDetailPage.tsx": "Displays detailed information for a single event (date, location, attendees, description) fetched by ID, and allows the current user to mark attendance with optimistic UI feedback.",
  "frontend/src/pages/EventsPage.tsx": "Lists all car meet events with a hero image, a create-event button, and a scrollable card list showing each event's image, date, location, and attendee count.",
  "frontend/src/pages/FollowersPage.tsx": "Shows a list of followers for a given user profile by fetching follower IDs and rendering each as a UserListItem component.",
  "frontend/src/pages/FollowingPage.tsx": "Shows a list of users that a given profile is following, fetching followee IDs and rendering each as a UserListItem component.",
  "frontend/src/pages/HomePage.tsx": "Renders an infinite-scroll feed of posts using IntersectionObserver to trigger pagination, with loading skeletons and an empty-state prompt.",
  "frontend/src/pages/MarketplacePage.tsx": "Displays a filterable grid of marketplace listings by category, showing each listing's image, price, condition badge, and seller info, with a create-listing button.",
  "frontend/src/pages/MechanicsPage.tsx": "Displays a list of mechanic-help questions fetched from the feed, with a hero image, an 'Ask a Question' button that navigates to the create page, and clickable question cards showing image, caption, author, and tags.",
  "frontend/src/pages/MechanicThreadPage.tsx": "Shows a Q&A thread for a mechanic-help post, displaying the original question with tags and a list of answers (comments), plus an input to submit a new answer.",
  "frontend/src/pages/MessagesPage.tsx": "Shows a list of users the current user is connected to (followers/following) and allows navigating to individual conversations; displays an empty state if no connections exist.",
  "frontend/src/pages/ProfilePage.tsx": "Renders a user profile page with avatar, stats, follow/unfollow actions, and tabbed views for posts, reels, and builds; supports editing own profile and deleting posts.",
  "frontend/src/pages/ReelsPage.tsx": "Full-screen vertical-scrolling reels feed that plays videos or shows images, supports like/unlike, comments, mute toggle, and delete for the reel author.",
  "frontend/src/pages/ReelsSearchPage.tsx": "Provides a debounced search interface for reels with category filter chips, displaying results as thumbnail cards with author info and captions.",
  "frontend/src/pages/StreetTubePage.tsx": "A self-contained YouTube-like video sharing page for car culture content, featuring user auth, video upload/playback, comments, subscriptions, likes, watch history, notifications, and dark/light theme — all persisted via localStorage.",
  "frontend/src/pages/TunerShopPage.tsx": "A static informational page for 'Altered Imports', a Honda/Acura performance shop in Wenatchee, WA, displaying a hero image, about section, services list, and contact/social links.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routing, persisting them to sessionStorage, and cleaning sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the default theme with custom fonts (Rajdhani, Inter), oklch-based color palettes (amber, asphalt, chart, sidebar), dark mode via class, and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state snapshot (version 87) describing the 'RevGrid' car-culture social media app's features, architecture notes, known bugs (branding issues, broken uploads, missing pages), and pending image edit requirements."
}