{
  "backend/main.mo": "Main Motoko actor for the RevGrid backend defining all data types (UserProfile, PostRecord, Comment, Message, Event, BuildShowcase, MarketplaceListing) and CRUD operations for a car-enthusiast social platform with authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report confirming that a visible entry point to the `/install` page was added to the app, with high confidence, referencing `TopBar.tsx` as the implementing file.",
  "frontend-file-summaries.txt": "A JSON document containing short summaries of each frontend source file, describing the purpose and recent changes of components, pages, and hooks in the RevGrid frontend.",
  "frontend/index.css": "Global Tailwind CSS stylesheet defining light and dark mode CSS custom properties (design tokens) for colors, borders, charts, and sidebar used throughout the app.",
  "frontend/index.html": "HTML entry point for the RevGrid PWA with full SEO metadata, Open Graph/Twitter card tags, PWA manifest link, Apple touch icon meta tags, and an inline service worker registration script.",
  "frontend/public/manifest.json": "PWA web app manifest for RevGrid specifying app name, theme/background colors, standalone display mode, start URL, and two icon sizes (192x192 and 512x512).",
  "frontend/public/sitemap.xml": "XML sitemap listing the main public URLs of revgrid.app with their change frequencies and priority values for SEO crawling.",
  "frontend/public/sw.js": "Service worker implementing a cache-first strategy for app shell assets and network-first for API/canister calls, with offline fallback to `index.html` for navigation requests.",
  "frontend/src/App.tsx": "Main React app entry point that defines all TanStack Router routes (including `/install`), wraps the app in an ErrorBoundary and ThemeProvider, and gates all routes behind the AuthGate component.",
  "frontend/src/components/AuthGate.tsx": "Guards the app behind authentication, showing a loading spinner, landing/intro page, or profile setup form as needed before rendering children for authenticated users with profiles.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with links to Home, Reels, Discover, Leaderboard, and Profile, plus a center Create button that opens the CreatePostSheet.",
  "frontend/src/components/ClickableUsername.tsx": "Renders a user's display name or username as a clickable inline button that navigates to their profile page, with optional @-prefix formatting.",
  "frontend/src/components/CommentsSheet.tsx": "Bottom sheet displaying a post's comments with author avatars and timestamps, plus an input form to submit new comments.",
  "frontend/src/components/CreatePostSheet.tsx": "Bottom sheet presenting creation options (Feed Post, Reel, Build Showcase, Mechanic Question, Marketplace listing) that navigate to the corresponding creation route.",
  "frontend/src/components/EditProfileModal.tsx": "Dialog modal for editing a user's display name, bio, car info, and profile picture, with file size validation and separate mutation calls for photo upload and profile save.",
  "frontend/src/components/LandingPage.tsx": "Landing page that plays an auto-advancing intro slideshow with background music before transitioning to a login screen where users authenticate via Internet Identity.",
  "frontend/src/components/Layout.tsx": "Defines the main app layout with a fixed TopBar, a sponsor banner row (eBay, BullBoost, Enjuku Racing), a routed main content area via Outlet, and a BottomNav.",
  "frontend/src/components/PostCard.tsx": "Renders a social post card with author info, image, like/comment actions, and a delete confirmation dialog visible only to the post's author.",
  "frontend/src/components/TopBar.tsx": "Fixed top navigation bar that displays a dynamic page title and icon buttons for messages, notifications, StreetTube, tuner shop, app install, and about pages.",
  "frontend/src/components/UserListItem.tsx": "Displays a single user row with avatar, display name, username, and optional car info, navigating to the user's profile on click.",
  "frontend/src/hooks/useActor.ts": "React hook that creates and caches an authenticated or anonymous ICP backend actor using TanStack Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context with login, logout, and status tracking via DFINITY's AuthClient, exposed through a React context and hook.",
  "frontend/src/hooks/useLandingMusic.ts": "Hook that manages background audio playback for a landing page, supporting fade-in/fade-out, mute toggling, and graceful handling of browser autoplay restrictions.",
  "frontend/src/hooks/useQueries.ts": "Defines React Query hooks for all backend interactions including user profiles, posts, comments, builds, marketplace listings, events, and leaderboard data, using the actor from useActor and showing toast notifications on errors.",
  "frontend/src/index.css": "Global stylesheet that sets up Tailwind, imports Google Fonts (Bebas Neue and Inter), defines dark/light CSS custom properties using OKLCH colors, and adds utility styles for scrollbars and AI answer content.",
  "frontend/src/lib/utils.ts": "Utility module exporting a Tailwind class merger (cn), and timestamp formatting helpers (formatDistanceToNow, formatDate, formatDateTime) that convert nanosecond bigint timestamps to human-readable strings.",
  "frontend/src/main.tsx": "Application entry point that renders the React app wrapped in QueryClientProvider and InternetIdentityProvider, mounting it to the root DOM element.",
  "frontend/src/pages/AboutPage.tsx": "Static About page for RevGrid that displays the app's hero section, feature list, and a donation/support section with a copyable CashApp tag and navigation links.",
  "frontend/src/pages/BuildDetailPage.tsx": "Detail page for a single build showcase, displaying an image gallery with navigation arrows, build metadata, author info, and a comment section with the ability to add new comments.",
  "frontend/src/pages/BuildsPage.tsx": "Grid listing page for all build showcases, showing thumbnail images with titles and author handles, plus a button to navigate to the build creation page.",
  "frontend/src/pages/ChatThreadPage.tsx": "Displays a direct message thread between the current user and a recipient, enforcing a follow-relationship gate before allowing messaging, with send and follow actions.",
  "frontend/src/pages/CreateBuildPage.tsx": "Form page for creating a new car build showcase with title, description, specs, and an optional image upload (max 10 MB), embedding image data in the specs payload.",
  "frontend/src/pages/CreateEventPage.tsx": "Form page for creating a car meet event with title, location, date/time, and description fields, converting the date to nanoseconds before submitting.",
  "frontend/src/pages/CreateFeedPostPage.tsx": "Form page for creating a feed post with a caption, optional image upload, and tags, embedding the image as base64 in the caption payload before submission.",
  "frontend/src/pages/CreateListingPage.tsx": "Form page for creating a marketplace listing with title, price, category, condition, description, and an optional image upload, submitting the data via the createListing mutation.",
  "frontend/src/pages/CreateMechanicQuestionPage.tsx": "Page for submitting a mechanic question post with optional image upload, encoding the question and image as a JSON caption payload and navigating to /mechanics on success.",
  "frontend/src/pages/CreateReelPage.tsx": "Page for creating a reel post by uploading a video or image with a caption and category, encoding media as base64 in a JSON caption payload and navigating to /reels on success.",
  "frontend/src/pages/DiscoverPage.tsx": "Discover page with a user search input and tabbed grid view for browsing all posts, builds, reels, mechanic posts, and events, with shortcuts to reels search and marketplace.",
  "frontend/src/pages/EventDetailPage.tsx": "Detail page for a single event showing its hero image, date, location, and attendee info, with loading/error/not-found states and an attend action.",
  "frontend/src/pages/EventsPage.tsx": "Events listing page displaying all car meet/show events with skeleton loading and error states, plus a dialog form for creating new events.",
  "frontend/src/pages/FollowersPage.tsx": "Page that lists all followers of a given user by fetching their IDs and rendering each as a UserListItem component.",
  "frontend/src/pages/FollowingPage.tsx": "Page that lists all users a given user is following by fetching their IDs and rendering each as a UserListItem component.",
  "frontend/src/pages/HomePage.tsx": "Displays an infinite-scroll feed of posts using IntersectionObserver to trigger pagination, with loading skeletons, error state with retry, and an empty state message.",
  "frontend/src/pages/InstallPage.tsx": "PWA install page that handles the browser's beforeinstallprompt event for one-click installation and shows manual step-by-step instructions for Android/Chrome users.",
  "frontend/src/pages/LeaderboardPage.tsx": "Renders a motorsport-themed leaderboard with a top-3 podium display and a ranked list of users sorted by follower count, using data from the useGetLeaderboard hook.",
  "frontend/src/pages/MarketplacePage.tsx": "Marketplace page showing a filterable grid of car part listings by category, with each card displaying image, price, condition badge, and seller info.",
  "frontend/src/pages/MechanicsPage.tsx": "Lists community mechanic help questions filtered by PostType.mechanic, featuring a hero banner, an AI-powered answers promo section, and a button to create a new question.",
  "frontend/src/pages/MechanicThreadPage.tsx": "Detail page for a mechanic question post that shows an AI-generated answer card alongside community comments, with a comment input form.",
  "frontend/src/pages/MessagesPage.tsx": "Displays a list of connected users (followers/following) the current user can message, rendering each as a clickable ConversationItem that navigates to a specific conversation route.",
  "frontend/src/pages/ProfilePage.tsx": "Renders a user's profile page with avatar, stats, follow/unfollow actions, and tabbed views for feed posts, reels, and builds, supporting both own-profile and other-user views.",
  "frontend/src/pages/ReelsPage.tsx": "Full-screen vertical scroll reels viewer that plays videos or shows images one at a time, with like, delete, comments, and mute controls per reel item.",
  "frontend/src/pages/ReelsSearchPage.tsx": "Search page for reels featuring debounced text search, category filter chips, and a grid of ReelCard thumbnails linking back to the main reels page.",
  "frontend/src/pages/StreetTubePage.tsx": "A self-contained YouTube-like video platform (StreetTube) built with localStorage persistence, supporting user auth, video upload/playback, subscriptions, likes, comments, watch history, notifications, and light/dark theming.",
  "frontend/src/pages/TunerShopPage.tsx": "React page component for 'Altered Imports', a Honda & Acura performance shop, displaying a hero image, about section, services list with icons, and contact/location info.",
  "frontend/src/utils/urlParams.ts": "Utility module providing functions to read URL parameters from both query strings and hash-based routes, persist them in sessionStorage, and clean sensitive params from the URL bar.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom fonts (Rajdhani, Inter), an oklch-based color palette (amber, asphalt, semantic tokens), and plugins for typography, container queries, and animations.",
  "project_state.json": "Project state metadata for 'RevGrid' tracking schema version, existing features, and pending feature requests related to adding a PWA install page and navigation entry point."
}