{
  "backend/main.mo": "Main Motoko actor defining the full backend for a car-enthusiast social app, including data types and state maps for users, posts, comments, messages, events, builds, marketplace listings, follows, and likes, along with authorization and blob storage mixins.",
  "feature_evidence.json": "Feature evidence report confirming that a persistent clickable BullBoost Performance logo banner (linking to bullboostperformance.com) was added to the authenticated Layout component, with high confidence tied to test REQ-110.",
  "frontend-file-summaries.txt": "A JSON-formatted catalogue of short summaries for all frontend source files, describing the purpose and key behaviors of each component, page, and hook in the app.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property tokens for light and dark themes (colors, radius, sidebar, charts) used throughout the app.",
  "frontend/index.html": "Minimal HTML shell with the page title set to 'RevReel' and a root div where the React app mounts via main.tsx.",
  "frontend/src/App.tsx": "Root React component that sets up TanStack Router with all app routes nested under an AuthGate/Layout shell, and wraps everything in a class-based ErrorBoundary that shows a styled fallback UI on uncaught render errors.",
  "frontend/src/components/AuthGate.tsx": "Authentication gate that plays the landing page intro on every load, handles Internet Identity auth state with timeout fallbacks, and shows a profile setup form for newly authenticated users who have no saved profile.",
  "frontend/src/components/BottomNav.tsx": "Fixed bottom navigation bar with icons for Home, Reels, Discover, Create (opens a sheet), Events, and Profile, highlighting the active route and using TanStack Router for navigation.",
  "frontend/src/components/CommentsSheet.tsx": "A bottom sheet component for viewing and adding comments on a post, displaying each comment with the author's avatar, username, text, and date.",
  "frontend/src/components/CreatePostSheet.tsx": "A bottom sheet that presents content creation options (Feed Post, Reel, Build Showcase, Mechanic Question, Marketplace listing) and navigates to the selected creation route.",
  "frontend/src/components/EditProfileModal.tsx": "A dialog modal for editing user profile fields (display name, bio, car info) and uploading a new profile picture, with file size validation and save/error handling.",
  "frontend/src/components/LandingPage.tsx": "An animated landing page with a car image slideshow intro phase that transitions to a login phase, auto-forwarding already-authenticated users into the app.",
  "frontend/src/components/Layout.tsx": "The main app shell that composes the TopBar, affiliate/sponsor banners, a routed main content area via Outlet, and the BottomNav.",
  "frontend/src/components/PostCard.tsx": "A card component for displaying a social feed post with author info, image, like/unlike toggle, comment count, and a delete option for the post's author.",
  "frontend/src/components/TopBar.tsx": "A fixed top navigation bar that shows a dynamic page title based on the current route and provides icon buttons for messages, notifications, tuner shop, and about page.",
  "frontend/src/components/UserListItem.tsx": "A button component that displays a user's avatar, display name, username, and car info, navigating to their profile on click or invoking an optional callback.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing ICP Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes React Query hooks for all backend data fetching and mutations (user profiles, posts, comments, feeds, builds, etc.) using the actor from useActor.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures a dark automotive-themed CSS variable design system with amber accents, and defines utility classes like glass-card and racing-stripe.",
  "frontend/src/lib/utils.ts": "Utility functions for merging Tailwind class names and formatting bigint nanosecond timestamps into human-readable relative or absolute date strings.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "A static informational page describing the RevGrid platform's features, mission, and a donation/support section with a copyable CashApp tag.",
  "frontend/src/pages/BuildDetailPage.tsx": "A detail page for a single car build showing an image gallery with navigation, build metadata, and a comment section with add-comment functionality.",
  "frontend/src/pages/BuildsPage.tsx": "Displays a grid of all car build showcases fetched via `useGetAllBuilds`, with navigation to individual builds and a button to create a new build.",
  "frontend/src/pages/ChatThreadPage.tsx": "Renders a direct message thread between the current user and a recipient, enforcing a follow-relationship requirement before allowing messaging and supporting sending new messages.",
  "frontend/src/pages/CreateBuildPage.tsx": "Form page for creating a new car build showcase with a title, description, specs, and an optional image upload (max 10 MB), submitting via `useCreateBuild`.",
  "frontend/src/pages/CreateEventPage.tsx": "Form page for creating a new car meet event with title, location, date/time, and description fields, submitting via `useCreateEvent`.",
  "frontend/src/pages/CreateFeedPostPage.tsx": "Form page for creating a new feed post with a caption, tags, and an optional image upload (max 10 MB), submitting via `useCreatePost`.",
  "frontend/src/pages/CreateListingPage.tsx": "Form page for creating a new marketplace listing with title, price, category, condition, description, and an optional image upload, submitting via `useCreateListing`.",
  "frontend/src/pages/CreateMechanicQuestionPage.tsx": "Form page for creating a mechanic question post with optional image upload (max 10 MB), tag input, and submission via the useCreatePost hook.",
  "frontend/src/pages/CreateReelPage.tsx": "Form page for creating a reel post supporting video or image upload (max 10 MB), category selection, tags, and submission via the useCreatePost hook.",
  "frontend/src/pages/DiscoverPage.tsx": "Discovery page with a user search bar, shortcut buttons for Reels and Marketplace, and a tabbed grid view of posts, builds, reels, mechanics, and events.",
  "frontend/src/pages/EventDetailPage.tsx": "Detail page for a single event showing its image, date, location, attendee count, and description, with an attend button that updates local state on success.",
  "frontend/src/pages/EventsPage.tsx": "Lists all car meet events with a hero image, a create-event button, and a scrollable list of event cards showing date, location, and attendee count.",
  "frontend/src/pages/FollowersPage.tsx": "Displays a list of followers for a given user profile by fetching follower IDs and rendering each as a UserListItem component.",
  "frontend/src/pages/FollowingPage.tsx": "Displays a list of users that a given profile is following by fetching following IDs and rendering each as a UserListItem component.",
  "frontend/src/pages/HomePage.tsx": "Displays a feed of all posts using PostCard components, with loading skeletons and an empty state. Includes a manual refresh button.",
  "frontend/src/pages/MarketplacePage.tsx": "Shows a filterable grid of marketplace listings with category tabs, listing cards (image, price, condition, seller info), and a button to create new listings.",
  "frontend/src/pages/MechanicsPage.tsx": "Lists community mechanic help questions filtered by PostType.mechanic, with a hero image, an 'Ask a Question' button, and navigation to individual thread pages.",
  "frontend/src/pages/MechanicThreadPage.tsx": "Displays a single mechanic Q&A thread with the original question, its tags/image, and a list of answers/comments, plus an input to submit new answers.",
  "frontend/src/pages/MessagesPage.tsx": "Shows a list of connected users (followers/following) as conversation entry points; displays an empty state if no connections exist.",
  "frontend/src/pages/ProfilePage.tsx": "Renders a user profile with avatar, stats (followers/following), follow/unfollow actions, edit profile modal, and tabbed post grids for feed, reels, and builds.",
  "frontend/src/pages/ReelsPage.tsx": "Full-screen vertical reels feed page with snap scrolling, supporting video/image media, like/unlike, comments, and delete actions. Parses captions that may contain embedded base64 media data alongside plain text.",
  "frontend/src/pages/ReelsSearchPage.tsx": "Search page for reels with debounced query input, category filter chips, and a grid of reel cards showing thumbnails, author info, and captions. Navigates to the main reels feed on card click.",
  "frontend/src/pages/TunerShopPage.tsx": "Static informational page for 'Altered Imports,' a Honda/Acura performance shop, displaying a hero image, about section, services list, and contact details.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routing, persisting them to sessionStorage, and cleaning sensitive params from the URL hash without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color palettes (amber, asphalt, chart, sidebar), custom heading/body fonts, and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the full project state for 'RevGrid', a car enthusiast social media app, including feature list, architectural notes, known issues, and versioning metadata. Serves as the source of truth for build planning and feature tracking."
}