{
  "backend/main.mo": "Main Motoko actor defining all stable state (users, posts, comments, messages, events, builds, marketplace listings, follows, likes) and backend API for the RevGrid car enthusiast social platform, with authorization and blob storage mixins included.",
  "feature_evidence.json": "Feature evidence report confirming that the Google Search Console site verification meta tag was added to `frontend/index.html`, mapped to test ID REQ-127 with high confidence.",
  "frontend-file-summaries.txt": "JSON document containing one-sentence summaries of all frontend source files, describing the purpose and key behaviors of each component, page, and hook in the RevGrid app.",
  "frontend/index.css": "Global Tailwind CSS entry point defining light and dark mode CSS custom properties (design tokens) for colors, borders, charts, and sidebar used throughout the app.",
  "frontend/index.html": "HTML entry point for the RevGrid app including Google site verification meta tag, full SEO metadata (title, description, keywords, robots), Open Graph tags, and Twitter Card tags.",
  "frontend/public/sitemap.xml": "XML sitemap listing all public RevGrid pages (feed, reels, discover, events, marketplace, about, tuner-shop, reels-search) with change frequencies and priorities for search engine indexing.",
  "frontend/src/App.tsx": "Main React app entry point that defines all TanStack Router routes wrapped in an `AuthGate` and `Layout`, and includes a class-based `ErrorBoundary` that renders a styled fallback UI on uncaught render errors.",
  "frontend/src/components/AuthGate.tsx": "Authentication gate component that always plays the landing page intro on load, handles Internet Identity login, enforces auth and profile-loading timeouts, and shows a profile setup form for new users before rendering the authenticated app.",
  "frontend/src/components/BottomNav.tsx": "Renders a fixed bottom navigation bar with links to main app routes and a center 'Create' button that opens the CreatePostSheet.",
  "frontend/src/components/CommentsSheet.tsx": "A bottom sheet component that displays comments for a given post and allows the current user to submit new comments.",
  "frontend/src/components/CreatePostSheet.tsx": "A bottom sheet presenting content creation options (feed post, reel, build, mechanic question, marketplace listing) that navigate to the corresponding creation routes.",
  "frontend/src/components/EditProfileModal.tsx": "A dialog modal for editing user profile fields (display name, bio, car info) and uploading a new profile picture, with validation and save logic.",
  "frontend/src/components/LandingPage.tsx": "An animated landing page with an image slideshow intro, background music controls, and an Internet Identity login flow that auto-forwards authenticated users.",
  "frontend/src/components/Layout.tsx": "The main app shell that composes TopBar, affiliate/sponsor banners, the routed page content via Outlet, and BottomNav.",
  "frontend/src/components/PostCard.tsx": "Displays a single social post with author info, image, like/comment actions, and a delete option for the post's author.",
  "frontend/src/components/TopBar.tsx": "Fixed top navigation bar that displays the current page title and provides icon buttons for messages, notifications, tuner shop, and about page navigation.",
  "frontend/src/components/UserListItem.tsx": "Reusable button component that renders a user's avatar, display name, username, and car info, navigating to their profile on click.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an authenticated or anonymous ICP backend actor using React Query, invalidating dependent queries when the identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and provider, exposing login/logout functions, identity state, and login status via a React context hook.",
  "frontend/src/hooks/useLandingMusic.ts": "Custom hook that manages background audio playback for the landing page, supporting fade-in/fade-out, mute toggling, and graceful autoplay fallback.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks wrapping backend actor calls for fetching and mutating users, posts, feeds, builds, events, messages, and other app data.",
  "frontend/src/index.css": "Global stylesheet defining a dark automotive-themed design system with Tailwind CSS, custom OKLCH color tokens, and utility classes for effects like amber glow and glass cards.",
  "frontend/src/lib/utils.ts": "Utility functions for merging Tailwind class names and formatting bigint nanosecond timestamps into human-readable relative or absolute date strings.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app with QueryClientProvider and InternetIdentityProvider wrappers.",
  "frontend/src/pages/AboutPage.tsx": "Displays the RevGrid app's about/info page with a hero section, feature list, and a CashApp donation button with copy-to-clipboard functionality.",
  "frontend/src/pages/BuildDetailPage.tsx": "Shows a single car build's detail view with an image gallery, build info, and a comment section allowing logged-in users to add comments.",
  "frontend/src/pages/BuildsPage.tsx": "Lists all car build showcases in a 2-column grid with thumbnails and navigates to individual build details or a create-build form.",
  "frontend/src/pages/ChatThreadPage.tsx": "Renders a direct message thread between two users, enforcing a follow-relationship requirement before messaging and supporting real-time message sending.",
  "frontend/src/pages/CreateBuildPage.tsx": "Form page for creating a new car build showcase with title, description, specs, and an image upload (max 10 MB) that embeds media data into the specs field.",
  "frontend/src/pages/CreateEventPage.tsx": "Form page for creating a new car meet event with title, location, date/time, and description fields, converting the date to nanoseconds before submission.",
  "frontend/src/pages/CreateFeedPostPage.tsx": "A form page for creating a new feed post with a caption, optional image upload (max 10 MB), and tags; encodes media as base64 in the caption JSON before submitting via the `useCreatePost` hook.",
  "frontend/src/pages/CreateListingPage.tsx": "A form page for creating a marketplace listing with title, description, price, condition, category, and an optional image upload; submits via the `useCreateListing` hook and navigates to `/marketplace` on success.",
  "frontend/src/pages/CreateMechanicQuestionPage.tsx": "A form page for posting a mechanic question with a description, optional image attachment, and tags; encodes media as base64 JSON in the caption and submits as a `PostType.mechanic` post.",
  "frontend/src/pages/CreateReelPage.tsx": "A form page for creating a reel post supporting video or image uploads (max 10 MB), a caption, tags, and a category selector; encodes media as base64 JSON and submits as a `PostType.reel` post.",
  "frontend/src/pages/DiscoverPage.tsx": "A discovery page with a search bar for users and a tabbed grid view for browsing all posts, builds, reels, mechanic posts, and events; clicking a grid item navigates to the relevant detail page.",
  "frontend/src/pages/EventDetailPage.tsx": "Displays detailed information for a single event (date, location, attendees, description) fetched by ID, and allows the current user to mark attendance with optimistic UI feedback.",
  "frontend/src/pages/EventsPage.tsx": "Lists all car meet events with a hero image, a create-event button, and a scrollable card list showing each event's image, date, location, and attendee count.",
  "frontend/src/pages/FollowersPage.tsx": "Shows a list of followers for a given user profile by fetching follower IDs and rendering each as a UserListItem component.",
  "frontend/src/pages/FollowingPage.tsx": "Shows a list of users that a given profile is following, rendering each followee as a UserListItem component.",
  "frontend/src/pages/HomePage.tsx": "Renders an infinite-scroll feed of posts using an IntersectionObserver sentinel, with skeleton loading states and an end-of-feed indicator.",
  "frontend/src/pages/MarketplacePage.tsx": "Displays a filterable grid of marketplace listings by category, showing each listing's image, price, condition badge, and seller info, with a create-listing button.",
  "frontend/src/pages/MechanicsPage.tsx": "Displays a list of mechanic-help questions fetched from the feed, with a hero image, an 'Ask a Question' button that navigates to the creation page, and clickable question cards showing image, caption, author, and tags.",
  "frontend/src/pages/MechanicThreadPage.tsx": "Shows a Q&A thread for a mechanic post, displaying the original question with tags and a list of answers (comments), plus an input to submit a new answer.",
  "frontend/src/pages/MessagesPage.tsx": "Shows a list of conversations with users who share a follow relationship with the current user, rendering each as a clickable item that navigates to the conversation view, or an empty state if no connections exist.",
  "frontend/src/pages/ProfilePage.tsx": "Renders a user profile page with avatar, stats, follow/unfollow actions, and tabbed sections for feed posts, reels, and builds, supporting both own-profile and other-user views with post deletion.",
  "frontend/src/pages/ReelsPage.tsx": "Implements a TikTok-style vertical-scrolling reels feed with auto-play video, like/comment actions, delete support for the author, and parsing of caption fields that may embed base64 media data.",
  "frontend/src/pages/ReelsSearchPage.tsx": "Provides a debounced search interface for reels with category filter chips, displaying results as thumbnail cards or skeleton loaders, and navigating to the reels feed on card click.",
  "frontend/src/pages/TunerShopPage.tsx": "React page for 'Altered Imports', a Honda & Acura performance shop in Wenatchee, WA. Displays a hero image, about section, list of services with icons, and contact/social media info.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading, persisting, and clearing URL parameters from both query strings and hash-based routes. Supports sessionStorage fallback for parameters like admin tokens.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark mode, custom fonts (Rajdhani, Inter), and an extended color palette using oklch values including amber, asphalt, chart, and sidebar tokens. Includes typography, container-queries, and animate plugins.",
  "project_state.json": "Project state snapshot (version 75) for 'RevGrid', a car-culture social media app. Documents architecture, existing features, and known issues such as broken auth, missing upload inputs, and navigation bugs."
}