{
  "backend/main.mo": "Main Motoko actor defining all backend state and logic for a car-enthusiast social app, including user profiles, posts, comments, messages, events, builds, marketplace listings, follows, and likes, with access control via mixins.",
  "feature_evidence.json": "Feature evidence report JSON documenting implemented features, primarily the TunerShopPage for 'Altered Imports' with its required sections, styling, and content.",
  "frontend-file-summaries.txt": "JSON map of short summaries for each frontend source file, describing the purpose and key details of every component, page, and hook in the frontend.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom properties for light and dark theme color tokens used throughout the app.",
  "frontend/index.html": "Minimal HTML shell with the page title set to 'RevReel' and a root div that mounts the React app via main.tsx.",
  "frontend/src/App.tsx": "TanStack Router configuration declaring all app routes (feed, reels, profile, messages, builds, marketplace, tuner shop, etc.) wrapped in AuthGate and Layout.",
  "frontend/src/components/AuthGate.tsx": "Authentication gate that shows a landing page for unauthenticated users, a profile setup form for new users, and renders children for fully authenticated users with existing profiles.",
  "frontend/src/components/BottomNav.tsx": "Renders a fixed bottom navigation bar with links to main app routes and a Create button that opens the CreatePostSheet.",
  "frontend/src/components/CommentsSheet.tsx": "A bottom sheet component that displays comments for a given post and allows the current user to submit new comments.",
  "frontend/src/components/CreatePostSheet.tsx": "A bottom sheet presenting content creation options (feed post, reel, build, mechanic question, marketplace listing) that navigate to the corresponding creation routes.",
  "frontend/src/components/EditProfileModal.tsx": "A dialog modal for editing the current user's profile, including display name, bio, car info, and profile picture upload.",
  "frontend/src/components/LandingPage.tsx": "The unauthenticated landing page displaying the RevGrid branding and an Internet Identity login button.",
  "frontend/src/components/Layout.tsx": "The main app shell that composes TopBar, an affiliate parts banner, the routed page content via Outlet, and BottomNav.",
  "frontend/src/components/PostCard.tsx": "Displays a single feed post with author info, image, like/comment actions, and a delete option for the post's author.",
  "frontend/src/components/TopBar.tsx": "A fixed top header bar showing the current page title and icon buttons for messages, notifications, tuner shop, and about page navigation.",
  "frontend/src/components/UserListItem.tsx": "A button component that displays a user's avatar, display name, username, and optional car info, navigating to their profile on click or calling an optional onClick handler.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an Internet Computer actor (authenticated or anonymous) using TanStack Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing DFINITY Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes TanStack Query hooks for all backend interactions including fetching/mutating posts, comments, likes, user profiles, builds, and follows using the actor from useActor.",
  "frontend/src/index.css": "Global stylesheet that sets up a dark automotive-themed design system using Tailwind CSS with custom OKLCH color tokens, Rajdhani/Inter fonts, and utility classes like amber-glow and glass-card.",
  "frontend/src/lib/utils.ts": "Utility module exporting a Tailwind class merger (cn), and timestamp formatting helpers (formatDistanceToNow, formatDate, formatDateTime) that convert nanosecond bigint timestamps.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "A static informational page describing the RevGrid platform's features, mission, and a donation/support section with a copyable CashApp tag.",
  "frontend/src/pages/BuildDetailPage.tsx": "A detail page for a single car build that displays an image gallery with navigation, build metadata, and a comments section with the ability to add new comments.",
  "frontend/src/pages/BuildsPage.tsx": "Displays a grid of all car build showcases fetched via `useGetAllBuilds`, with navigation to individual builds and a button to create a new build.",
  "frontend/src/pages/ChatThreadPage.tsx": "Renders a direct message thread between the current user and a recipient, enforcing a follow-relationship requirement before allowing messaging and supporting sending new messages.",
  "frontend/src/pages/CreateBuildPage.tsx": "Form page for creating a new car build showcase with a title, description, specs, and an optional image upload (max 10 MB), submitting via `useCreateBuild`.",
  "frontend/src/pages/CreateEventPage.tsx": "Form page for creating a new car meet event with title, location, date/time, and description fields, submitting via `useCreateEvent`.",
  "frontend/src/pages/CreateFeedPostPage.tsx": "Form page for creating a new feed post with a caption, tags, and an optional image upload (max 10 MB), submitting via `useCreatePost`.",
  "frontend/src/pages/CreateListingPage.tsx": "Form page for creating a new marketplace listing with title, price, category, condition, description, and an optional image upload (max 10 MB), submitting via `useCreateListing`.",
  "frontend/src/pages/CreateMechanicQuestionPage.tsx": "Form page for creating a mechanic question post with optional image upload (max 10 MB), tag input, and submission via the useCreatePost hook.",
  "frontend/src/pages/CreateReelPage.tsx": "Form page for creating a reel post supporting image or video upload (max 10 MB), category selection, tags, and submission via the useCreatePost hook.",
  "frontend/src/pages/DiscoverPage.tsx": "Discovery page with a user search bar, shortcut buttons for Reels and Marketplace, and a tabbed grid displaying posts, builds, reels, mechanics, or events.",
  "frontend/src/pages/EventDetailPage.tsx": "Detail view for a single event showing its image, date, location, attendee count, and description, with an attend button that updates local state on success.",
  "frontend/src/pages/EventsPage.tsx": "Lists all car meet events with a hero image, a create-event button, and a scrollable list of event cards showing date, location, and attendee count.",
  "frontend/src/pages/FollowersPage.tsx": "Displays a list of followers for a given user profile by fetching follower IDs and rendering each as a UserListItem component.",
  "frontend/src/pages/FollowingPage.tsx": "Displays a list of users that a given profile is following by fetching followee IDs and rendering each as a UserListItem component.",
  "frontend/src/pages/HomePage.tsx": "Displays a feed of all posts using PostCard components, with loading skeletons and an empty state. Includes a manual refresh button.",
  "frontend/src/pages/MarketplacePage.tsx": "Shows a filterable grid of marketplace listings with category tabs, listing cards (image, price, condition, seller info), and a button to create new listings.",
  "frontend/src/pages/MechanicsPage.tsx": "Lists community mechanic help questions filtered by PostType.mechanic, with a hero image, an 'Ask a Question' button, and navigation to individual thread pages.",
  "frontend/src/pages/MechanicThreadPage.tsx": "Displays a single mechanic Q&A thread with the original question, its tags/image, and a list of community answers, plus an input to submit a new answer.",
  "frontend/src/pages/MessagesPage.tsx": "Shows a list of users connected via follow relationships (followers/following) that the current user can open direct message conversations with.",
  "frontend/src/pages/ProfilePage.tsx": "Renders a user profile page with avatar, stats (followers/following), tabbed post/reel/build grids, follow/unfollow actions, and an edit profile modal for the owner.",
  "frontend/src/pages/ReelsPage.tsx": "Full-screen vertical scrolling reels page that displays video/image posts with like, comment, delete, and mute controls. Parses captions for embedded base64 media and supports snap-scroll navigation between reels.",
  "frontend/src/pages/ReelsSearchPage.tsx": "Search page for reels with debounced query input, category filter chips, and a grid of reel cards showing thumbnails, author info, and captions. Includes skeleton loading states and navigates to the main reels page on card click.",
  "frontend/src/pages/TunerShopPage.tsx": "Static informational page for 'Altered Imports,' a Honda/Acura performance shop, displaying a hero image, about section, services list with icons, and contact/social links.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading URL query parameters from both standard and hash-based routing, persisting them to sessionStorage, and cleaning sensitive params from the URL hash without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration with dark mode, custom OKLCH-based color palettes (primary, amber, asphalt, chart, sidebar), custom heading/body fonts (Rajdhani/Inter), and plugins for typography, container queries, and animations.",
  "project_state.json": "Tracks the full project state for RevGrid, a car enthusiast social media app, including architectural notes, known issues, existing features, and image requirements at schema version 1.0.0 / project state version 43."
}