{
  "backend/main.mo": "Main Motoko actor defining all backend data types, state maps, and query/update functions for a car-community social app including users, posts, comments, messages, events, builds, marketplace listings, follows, and likes, with authorization via access control mixins.",
  "feature_evidence.json": "Feature evidence report listing implemented features with their associated source files, component dependencies, test IDs, and confidence levels — primarily covering file size limit increases to 10 MB across multiple create-post pages.",
  "frontend-file-summaries.txt": "A JSON-formatted text file containing short descriptions of each frontend source file, serving as a human-readable index of component responsibilities and recent changes across the React frontend.",
  "frontend/index.css": "Global Tailwind CSS entry point defining CSS custom property design tokens for light and dark themes including colors, borders, radii, and sidebar/chart variables.",
  "frontend/index.html": "Minimal HTML shell with the page title set to 'RevReel' that mounts the React app via a root div and a module script pointing to src/main.tsx.",
  "frontend/src/App.tsx": "Defines the TanStack Router configuration with all application routes (home, reels, discover, events, profile, messages, mechanics, builds, marketplace, about) wrapped in an AuthGate and Layout component.",
  "frontend/src/components/AuthGate.tsx": "Authentication gate that renders a landing page for unauthenticated users, a profile setup form for new users without a profile, and the app children for fully authenticated users with an existing profile.",
  "frontend/src/components/BottomNav.tsx": "Renders a fixed bottom navigation bar with links to Home, Reels, Discover, Events, and Profile, plus a Create button that opens the CreatePostSheet.",
  "frontend/src/components/CommentsSheet.tsx": "A bottom sheet component that displays comments for a given post and allows the current user to submit new comments.",
  "frontend/src/components/CreatePostSheet.tsx": "A bottom sheet presenting content creation options (Feed Post, Reel, Build Showcase, Mechanic Question, Marketplace listing) that navigate to the corresponding creation routes.",
  "frontend/src/components/EditProfileModal.tsx": "A dialog modal for editing the user's profile, supporting display name, bio, car info, and profile picture upload with save functionality.",
  "frontend/src/components/LandingPage.tsx": "The unauthenticated landing page displaying the RevGrid branding and an Internet Identity login button.",
  "frontend/src/components/Layout.tsx": "The main app layout wrapping all authenticated pages with a TopBar, an affiliate parts banner, a content outlet, and a BottomNav.",
  "frontend/src/components/PostCard.tsx": "Displays a single feed post with author info, image, like/comment actions, and a delete option for the post's author.",
  "frontend/src/components/TopBar.tsx": "A fixed top header bar showing the current page title and navigation buttons for Messages, Notifications, and About.",
  "frontend/src/components/UserListItem.tsx": "A button component that displays a user's avatar, display name, username, and optional car info, navigating to their profile on click or calling an optional onClick handler.",
  "frontend/src/hooks/useActor.ts": "A React hook that creates and caches an Internet Computer actor (authenticated or anonymous) using TanStack Query, invalidating dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an InternetIdentityProvider and useInternetIdentity hook for managing Internet Identity authentication state, including login, logout, and identity persistence via AuthClient.",
  "frontend/src/hooks/useQueries.ts": "Centralizes TanStack Query hooks for all backend interactions including fetching/mutating posts, comments, likes, user profiles, and builds using the actor from useActor.",
  "frontend/src/index.css": "Global stylesheet that sets up a dark automotive-themed design system with Tailwind CSS, custom OKLCH color variables, Rajdhani/Inter fonts, and utility classes like amber-glow and glass-card.",
  "frontend/src/lib/utils.ts": "Utility module exporting a Tailwind class merger (cn), and timestamp formatting helpers (formatDistanceToNow, formatDate, formatDateTime) that convert nanosecond bigint timestamps.",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/AboutPage.tsx": "A static about page for the RevGrid app showcasing its features, description, and a donation section with a copyable CashApp handle.",
  "frontend/src/pages/BuildDetailPage.tsx": "A detail page for a single car build that displays an image gallery with navigation, build info, and a comment section with add-comment functionality.",
  "frontend/src/pages/BuildsPage.tsx": "Displays a grid of all car build showcases fetched via `useGetAllBuilds`, with navigation to individual builds and a button to create a new build.",
  "frontend/src/pages/ChatThreadPage.tsx": "Renders a direct message thread between the current user and a recipient, enforcing a follow-relationship requirement before allowing messaging and supporting sending new messages.",
  "frontend/src/pages/CreateBuildPage.tsx": "Form page for creating a new car build showcase with a title, description, specs, and an optional image upload (max 10 MB), submitting via `useCreateBuild`.",
  "frontend/src/pages/CreateEventPage.tsx": "Form page for creating a new car meet event with title, location, date/time, and description fields, submitting via `useCreateEvent`.",
  "frontend/src/pages/CreateFeedPostPage.tsx": "Form page for creating a new feed post with a caption, tags, and an optional image upload (max 10 MB), submitting via `useCreatePost`.",
  "frontend/src/pages/CreateListingPage.tsx": "Form page for creating a marketplace listing with title, price, category, condition, description, and an optional image upload (max 10 MB), submitting via `useCreateListing`.",
  "frontend/src/pages/CreateMechanicQuestionPage.tsx": "Form page for posting a mechanic question with an optional image attachment (max 10 MB), encoding media as base64 in the caption JSON before submitting via the createPost mutation.",
  "frontend/src/pages/CreateReelPage.tsx": "Form page for creating a reel post supporting video or image uploads (max 10 MB) with a category selector, encoding media as base64 JSON in the caption before submitting.",
  "frontend/src/pages/DiscoverPage.tsx": "Discover/search page displaying a tabbed grid of posts, builds, reels, mechanics, and events, with a user search input and shortcut buttons to Reels Search and Marketplace.",
  "frontend/src/pages/EventDetailPage.tsx": "Detail view for a single event showing its image, date, location, attendee count, and description, with a button to mark attendance via the attendEvent mutation.",
  "frontend/src/pages/EventsPage.tsx": "Lists all car meet events with thumbnail, date, location, and attendee count, plus a button to navigate to the event creation page.",
  "frontend/src/pages/FollowersPage.tsx": "Displays the list of followers for a given user profile by fetching follower IDs and rendering each as a UserListItem.",
  "frontend/src/pages/FollowingPage.tsx": "Displays the list of users a given profile is following by fetching following IDs and rendering each as a UserListItem.",
  "frontend/src/pages/HomePage.tsx": "Displays a feed of all posts using PostCard components, with loading skeletons, an empty state, and a manual refresh button.",
  "frontend/src/pages/MarketplacePage.tsx": "Shows a filterable grid of marketplace listings with category tabs, listing cards (image, price, condition, seller info), and a button to create new listings.",
  "frontend/src/pages/MechanicsPage.tsx": "Lists community mechanic help questions filtered by PostType.mechanic, with a hero image, an 'Ask a Question' button, and navigation to individual question threads.",
  "frontend/src/pages/MechanicThreadPage.tsx": "Renders a single mechanic Q&A thread showing the original question post, its comments/answers, and an input to submit a new answer.",
  "frontend/src/pages/MessagesPage.tsx": "Displays a list of connected users (followers/following) as conversation entry points, restricting chat to mutual connections and showing an empty state otherwise.",
  "frontend/src/pages/ProfilePage.tsx": "Shows a user profile with avatar, stats, follow/unfollow actions, edit profile modal, and tabbed views of the user's feed posts, reels, and builds.",
  "frontend/src/pages/ReelsPage.tsx": "Full-screen vertical-scrolling reels viewer that plays video/image posts one at a time, with like, comment, delete, mute/unmute, and author navigation controls. Parses reel captions that may contain embedded base64 media data alongside plain text.",
  "frontend/src/pages/ReelsSearchPage.tsx": "Search and browse reels page with debounced text search, predefined car-culture category filters, and a grid of reel cards showing thumbnails, author avatars, and captions.",
  "frontend/src/utils/urlParams.ts": "Utility module for reading URL query parameters from both standard and hash-based routes, persisting them to sessionStorage, and cleaning sensitive params from the URL bar without a page reload.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration defining dark-mode support, custom font families (Rajdhani, Inter), and an extended color palette including amber, asphalt, chart, and sidebar tokens mapped to OKLCH CSS variables.",
  "project_state.json": "Project state snapshot (version 41) describing RevGrid, a car-culture social media app, including its feature list, architectural notes, and known issues such as missing video upload input and broken post creation flow."
}