{
  "kind": "build_request",
  "title": "Fix blank screen load issue and add guest view mode",
  "projectName": "RevGrid",
  "priority": "high",
  "requirements": [
    {
      "id": "REQ-1",
      "text": "Diagnose and fix the blank white screen that prevents RevGrid from loading in production. Audit the root App.tsx, AuthGate.tsx, and routing/lazy-load setup to identify and resolve any initialization errors, missing fallbacks, or failed async imports that cause a blank screen on first load.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "It still doesn't load please fix it"
        ]
      },
      "acceptanceCriteria": [
        "The app renders visible content on first load in production without a blank white screen",
        "Lazy-loaded page components have proper Suspense fallbacks so no chunk failure silently renders nothing",
        "ErrorBoundary catches and displays a user-facing error message instead of a blank screen if a critical render error occurs",
        "The app loads correctly for both authenticated users and unauthenticated visitors"
      ]
    },
    {
      "id": "REQ-2",
      "text": "Implement a guest view mode so that unauthenticated visitors can browse all pages and see all content (feed posts, reels, builds, events, marketplace listings, mechanic questions, leaderboard, profiles, etc.) without being redirected to the landing page or blocked by the AuthGate. Guests must not be able to use any interactive features.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-1"
        ],
        "quotes": [
          "add a feature where you can see everything on the site as a guest but you just can't use any of the features"
        ]
      },
      "acceptanceCriteria": [
        "Unauthenticated (guest) users can view all public pages: feed, reels, builds, events, marketplace, mechanics, leaderboard, discover, and user profiles",
        "The AuthGate no longer blocks the entire app for unauthenticated users — it only blocks action-requiring flows",
        "All interactive controls that require authentication (like/unlike, comment, follow/unfollow, create post/build/reel/event/listing, send message, attend event) are visually disabled or show a 'Sign in to use this feature' prompt when clicked by a guest",
        "Guests are shown a persistent but non-intrusive banner or prompt encouraging them to log in with Internet Identity",
        "Navigating directly to creation pages (e.g. /create-post, /create-reel) as a guest redirects to the landing page or shows a login prompt instead of a blank or broken page"
      ]
    }
  ],
  "constraints": [
    "Do not modify files listed in frontend.immutablePaths: useInternetIdentity.ts, useActor.ts, main.tsx, and frontend/src/components/ui",
    "Guest mode must use the existing anonymous actor from useActor.ts (already supports unauthenticated calls) — do not add new backend endpoints",
    "All read/query backend calls must remain available to anonymous actors — do not add new access restrictions"
  ],
  "nonGoals": [
    "Adding new backend data or access control logic for guest users",
    "Changing the design or visual theme of the app",
    "Implementing partial feature access for guests (it is all-or-nothing: read-only browse vs. full authenticated access)"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}