{
  "kind": "build_request",
  "title": "Increase file size limit for reel/video uploads",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-63",
      "text": "Increase the maximum allowed file size for reel/video uploads on CreateReelPage (frontend/src/pages/CreateReelPage.tsx) from the current ~1.5–2 MB cap to at least 10 MB. Update the file size validation guard so that files up to 10 MB are accepted, and update the user-facing error message to reflect the new limit (e.g., 'File too large — please select a file under 10 MB'). The video preview, base64 encoding, and submission flow must continue to work correctly for larger files.",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Can you make it where bigger file can be uploaded longer reels"
        ]
      },
      "acceptanceCriteria": [
        "The file input on CreateReelPage accepts video and image files up to at least 10 MB without showing a size error.",
        "Files larger than 10 MB are rejected with a clear error message stating the new size limit.",
        "Files under 10 MB are correctly previewed (video element for video files, img element for images) and encoded as base64 before submission.",
        "The submission flow continues to work end-to-end for files within the new limit — the post is created and the user is navigated away on success.",
        "The old ~2 MB hard-coded size check is removed or replaced with the new 10 MB threshold."
      ]
    },
    {
      "id": "REQ-64",
      "text": "Update the backend createPost function in backend/main.mo to accept larger mediaData payloads. Ensure the Text field used to store base64-encoded media data on post records does not impose an artificially low size cap, and that the function does not trap or return an error for media payloads up to the ICP ingress message limit (~2 MB per call). If chunked or asset canister storage is not feasible, document the effective limit in a comment but ensure the frontend and backend limits are consistent so users are not shown conflicting errors.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "Can you make it where bigger file can be uploaded longer reels"
        ]
      },
      "acceptanceCriteria": [
        "The backend createPost function does not trap on a valid reel post with a large mediaData payload within the ICP message size limit.",
        "The function returns a structured #err result (not a trap) for any invalid or oversized input.",
        "Backend and frontend size limits are consistent — if the ICP cap limits payload size, the frontend error threshold matches."
      ]
    }
  ],
  "constraints": [
    "Do not break the existing reel category selector, caption, or tags fields on CreateReelPage.",
    "Do not modify files in frontend/src/hooks/useInternetIdentity.ts, frontend/src/hooks/useActor.ts, frontend/src/main.tsx, or frontend/src/components/ui.",
    "The file size increase must not break the existing post creation flow for smaller files."
  ],
  "nonGoals": [
    "Implementing chunked upload or asset canister streaming for files beyond the ICP ingress message limit.",
    "Changing the file size limit on CreateFeedPostPage or CreateListingPage — only reel uploads are in scope.",
    "Adding new reel categories or changing the reel creation UI beyond the file size guard."
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}