{
  "kind": "build_request",
  "title": "Profile picture upload",
  "priority": "normal",
  "requirements": [
    {
      "id": "REQ-47",
      "text": "Update the EditProfileModal (frontend/src/components/EditProfileModal.tsx) to include a profile picture upload field. Allow the user to select an image file from their device, show a circular preview of the selected image, encode it as base64, and call the `updateProfilePic` backend function on save. Display the uploaded profile picture throughout the app wherever the user's avatar is shown (ProfilePage, PostCard, CommentsSheet, UserListItem, ReelsPage, etc.).",
      "target": "frontend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "I want to be able to upload a profile pic"
        ]
      },
      "acceptanceCriteria": [
        "EditProfileModal contains a circular avatar preview that updates when a file is selected",
        "A native file input (accept='image/*') is present to select an image from device",
        "The selected image is encoded as base64 before submission",
        "On save, the base64 image data is submitted to the `updateProfilePic` backend function",
        "After saving, the new profile picture is immediately reflected in the ProfilePage header",
        "All other surfaces that display the user's avatar (PostCard, CommentsSheet, UserListItem, ReelsPage overlay) also show the updated profile picture"
      ]
    },
    {
      "id": "REQ-48",
      "text": "Extend the backend UserProfile data model in backend/main.mo to include a `profilePicData` field (as ?Text) for storing base64-encoded profile picture data. Add an `updateProfilePic` function that accepts the base64 image string and updates the caller's profile record. Ensure that all profile query functions return the `profilePicData` field so the frontend can render it as the user's avatar.",
      "target": "backend",
      "source": {
        "messageIds": [
          "msg-latest"
        ],
        "quotes": [
          "I want to be able to upload a profile pic"
        ]
      },
      "acceptanceCriteria": [
        "UserProfile type includes an optional `profilePicData : ?Text` field",
        "An `updateProfilePic(data: Text) : async ()` function exists, callable only by an authenticated user, that stores the base64 string in the caller's profile",
        "Existing profile query functions (getProfile, getProfileByPrincipal, etc.) return the `profilePicData` field",
        "Calling `updateProfilePic` with new data replaces any previously stored profile picture data",
        "A migration entry is generated to add the new nullable field to existing UserProfile records without breaking existing state"
      ]
    }
  ],
  "constraints": [
    "Do not break existing profile editing functionality (display name, bio, car info)",
    "Profile picture data must be stored on-chain in the backend actor, not via an external URL service"
  ],
  "nonGoals": [
    "Cover photo upload (only profile picture is in scope)",
    "Image cropping or resizing UI",
    "Support for video uploads as profile pictures"
  ],
  "imageRequirements": {
    "required": [],
    "edits": []
  }
}