{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Profile picture upload",
  "requirements": [
    {
      "id": "REQ-47",
      "summary": "Add profile picture upload to EditProfileModal with circular preview, base64 encoding, and display throughout the app",
      "acceptanceCriteria": [
        "EditProfileModal contains a circular avatar preview that updates when a file is selected",
        "A native file input (accept='image/*') is present to select an image from device",
        "The selected image is encoded as base64 before submission",
        "On save, the base64 image data is submitted to the `updateProfilePic` backend function",
        "After saving, the new profile picture is immediately reflected in the ProfilePage header",
        "All other surfaces that display the user's avatar (PostCard, CommentsSheet, UserListItem, ReelsPage overlay) also show the updated profile picture"
      ],
      "file_operations": [
        {
          "path": "frontend/src/components/EditProfileModal.tsx",
          "operation": "modify",
          "description": "Add a profile picture upload section with a native file input (accept='image/*'), display a circular avatar preview showing either the selected image or the current profile picture from userProfile.profilePicData (decoded from base64 as a data URL), encode the selected file as base64, and call the mutation hook for updateProfilePic with the base64 string on save. Ensure the modal layout accommodates the new upload field above the existing display name, ride info, and bio fields."
        },
        {
          "path": "frontend/src/hooks/useQueries.ts",
          "operation": "modify",
          "description": "Add a new mutation hook useUpdateProfilePic that calls actor.updateProfilePic(imageBase64: string), invalidates the 'currentUserProfile' query on success, and includes onError handling to display a user-friendly error message if the upload fails."
        },
        {
          "path": "frontend/src/pages/ProfilePage.tsx",
          "operation": "modify",
          "description": "Update the profile header avatar display to render the user's profile picture from userProfile.profilePicData (if present, decoded from base64 as a data URL) instead of the default avatar placeholder. Ensure the circular avatar image uses proper styling and fallback gracefully to the generated default-avatar.dim_128x128.png when profilePicData is null or undefined."
        },
        {
          "path": "frontend/src/components/PostCard.tsx",
          "operation": "modify",
          "description": "Update the author avatar display to render the author's profile picture from the user.profilePicData field (decoded from base64 as a data URL) if available. Fetch the author user data via the existing user query hook and display their profilePicData. Fallback to the default avatar image frontend/public/assets/generated/default-avatar.dim_128x128.png when profilePicData is null or undefined."
        },
        {
          "path": "frontend/src/components/CommentsSheet.tsx",
          "operation": "modify",
          "description": "Update the comment author avatar display to render each comment author's profile picture from their user.profilePicData field (decoded from base64 as a data URL) if available. Fetch each comment author's user data via the existing user query hook and display their profilePicData. Fallback to the default avatar image frontend/public/assets/generated/default-avatar.dim_128x128.png when profilePicData is null or undefined."
        },
        {
          "path": "frontend/src/components/UserListItem.tsx",
          "operation": "modify",
          "description": "Update the user avatar display to render the user's profile picture from user.profilePicData (decoded from base64 as a data URL) if available. Fallback to the default avatar image frontend/public/assets/generated/default-avatar.dim_128x128.png when profilePicData is null or undefined. Ensure the circular avatar styling is consistent with other avatar displays throughout the app."
        },
        {
          "path": "frontend/src/pages/ReelsPage.tsx",
          "operation": "modify",
          "description": "Update the ReelItem component (or the overlay author info section) to render the reel author's profile picture from the author's user.profilePicData field (decoded from base64 as a data URL) if available. Fetch the author user data via the existing user query hook and display their profilePicData. Fallback to the default avatar image frontend/public/assets/generated/default-avatar.dim_128x128.png when profilePicData is null or undefined."
        }
      ]
    }
  ]
}