{
  "kind": "implementation_plan",
  "version": "1.0",
  "title": "Replace BullBoost Performance banner image with newly uploaded logo",
  "requirements": [
    {
      "id": "REQ-153",
      "summary": "Replace the existing BullBoost Performance banner image with the newly uploaded logo (white text on black background) while maintaining the clickable affiliate link and horizontal sponsor layout",
      "acceptanceCriteria": [
        "The new BullBoost Performance logo (white text on black background, 1600x900 source) is saved as frontend/public/assets/generated/bullboost-logo.dim_760x200.png",
        "The BullBoost banner in Layout.tsx renders the new image instead of the old one",
        "Clicking the BullBoost banner opens https://bullboostperformance.com/?ref=xprbexxu in a new tab",
        "The banner row still displays all three sponsor banners (eBay, BullBoost, Enjuku Racing) side-by-side",
        "The banner is styled consistently with the app's dark automotive theme"
      ],
      "file_operations": [
        {
          "path": "frontend/public/assets/generated/bullboost-logo.dim_760x200.png",
          "operation": "create",
          "description": "Save the newly uploaded BullBoost Performance logo image (cropped and resized from the 1600x900 source image with white 'Bull Boost' script and 'PERFORMANCE' text on black background) as a static asset at frontend/public/assets/generated/bullboost-logo.dim_760x200.png, replacing any existing file at that path. This generated image will be referenced in Layout.tsx."
        },
        {
          "path": "frontend/src/components/Layout.tsx",
          "operation": "modify",
          "description": "Update the BullBoost banner anchor tag in the sponsor banner row to reference the new image file at frontend/public/assets/generated/bullboost-logo.dim_760x200.png. Ensure the anchor maintains target='_blank', rel='noopener noreferrer', and the affiliate link https://bullboostperformance.com/?ref=xprbexxu. Verify the image src path is correct (/assets/generated/bullboost-logo.dim_760x200.png) and that the banner remains horizontally aligned with the existing eBay and Enjuku Racing sponsor banners. Do not modify the eBay or Enjuku Racing banner implementations."
        }
      ]
    }
  ]
}